{
    "podcast_details": {
        "podcast_title": "TED Talks Daily",
        "episode_title": "A flavorful field guide to foraging | Alexis Nikole Nelson.mp3",
        "episode_image": "https://s3.castbox.fm/ba/29/59/f0fd0b5ba5845d85a24261a1786372463e_scaled_v1_400.jpg",
        "episode_transcript": " TED Audio Collective Hey y'all, I'm Elise Hu. You're listening to TED Talks Daily. Those of you on TikTok might be familiar with today's speaker. She's the foraging enthusiast Alexis Nicole Nelson. She shares her lifelong passion for finding delicious foods in nature, all while preparing sweet and salty kelp chips live on stage at TED 2022. And stick around after the talk for a conversation between Alexis and yours truly. If a vegan falls in the forest and no one's there to hear them say, I'm vegan! Are they even really vegan? I like to preface conversations about my dietary habits with jokes. Because brains love the ha-ha's. And because sometimes you say the word vegan, and people get a little afraid. Their mind immediately conjures this non-existent super-vegan, who's an amalgam of every annoying thing they've ever heard a vegan say. And at that point, they're checked out. Now if you've managed to somehow avoid the zeitgeist for the last 15 or 20 years, one, tell me how! One, tell me how! Two, I will tell you what vegan means, because I'm sure you're dying to know. So vegan is both a diet completely free of animal products and a person who follows that diet, often used interchangeably with plant-based, but like not necessarily done to decrease the amount of protein or not necessarily done to decrease animal suffering per se, but maybe to help one's health. But that is not the argument we came to have today. No siree-bob. Now I am an outdoor educator, I am a wild food forager, I am a reluctant social media star. And yes, I am a vegan. Thank you. That's not the reaction I usually get. At the age of five, upon realizing that the cows in the field and the cows on my dad's grill were the same cows, I asked my parents if I could go vegetarian, to which they said, sure, but let's wait until you're done growing first, so sure that I would change my mind over the next five to nine years. Well, shortly after my 12th birthday, I took the plunge and I gave up meat completely. It took another 12 years for me to give up eggs and dairy, and now, between the veganism and the foraging, I have one of the more eclectic pantries in the world. Now foraging is the art slash science of identifying, collecting and eating wild food. So if anyone's ever convinced you to try dandelions or wood sorrel, congratulations, you're a forager too. When my mom told me that there was a bunch of free food hanging out in lawns and sidewalks, my mind was blown. All of these free fruits, veggies and fungi that didn't require your water, didn't require your time, and often were healthier than their counterparts in the grocery store. Cute little fun fact just between us. We did this thing over the last hundred years where we bred foods to travel easier, be bigger, taste milder, and that often breeds out the nutrition. Let's take, for example, purslane or verdolagas, if you are in a Spanish-speaking part of the Americas. It is a weed that grows out of sidewalk cracks in the summertime. It is chock full of omega-3s, and it ain't a fish. Iron, get out of here, Popeye. And vitamin C, your immune system will thank you. Now, I am a forager and a vegan for much the same reason, my love of this planet and its inhabitants. But let me tell you, between those two identifiers, it's pretty hard to get people to try my food. Laughter You tell someone something's vegan, and you're already met with skepticism. Tell them it's vegan, and you pulled half of it out of the ground. Laughter It's a tough sell. So today, I'm going to give all of you my tips, my tricks on getting people to expand their palate and try wild vegan foods consensually. Laughter This is not the lying liar show. It is the slightly annoying but ultimately lovable tall vegan show. Laughter So today, we are going to be making a snack that happens to be vegan, happens to be great for the planet, happens to use one of my favorite ingredients. We are making sweet and salty kelp chips, a Korean snack known as desimaeogeok. Oh, thank you. A woo for the pronunciation. I was worried about it. Laughter Now, I know all of y'all's kids are obsessed with those nori seaweed snacks, so why not kick it up a notch with a locally-foraged ingredient, bulg kelp? Now, I'm going to give you my first tip when introducing a dish to skeptical mouths, it is best to use a dish that is not pretending to be something else. Laughter You know. That way, they have no prior associations, no memories to be comparing it to of their mother's version of it. Laughter Maybe they have no opinions about it at all. Now, seaweed and sea vegetables in general are a very exciting food space. They don't require fresh water, they don't require fertilizer, they don't even require land. They're just hanging out in the salty seas creating ecosystems, creating oxygen for all of us to breathe and creating these amino acid-rich snacks. In this day and age, seaweed is truly future-minded food. They're an option I wish more people would reach for as runoff, water access, labor issues, and monoculturing plague a lot of modern agriculture here in North America. Yeah. Applause Also, they taste real good! Those amino acids do a lot more than adding umami to your dishes, bull kelp on average packs 15.3 percent protein by weight. That is for everyone who asks where vegans get their protein from. We're fine. Laughter Now, as I said before, this dish is nothing new. It's a popular bar snack in parts of Korea, and we actually have a lot of accidentally vegan recipes historically. And the reason for that is because up until recently, we did not eat this much meat. Which is going to lead to my second tip. It's a little spicy, a little touchy, and it is this. Explain to your friends that the way that we are eating is not sustainable. Applause It's not. As we are constantly reaching for more land and more fresh water, we have set a precedent that our planet cannot keep up with. Tell them you are not trying to change their entire life. You just want them to be a bit more thoughtful with some of their choices, to go for those kelp chips instead of maybe pork rinds from the convenience store. I find that introducing people to wild foods in their area is an excellent way to foster their connection to their food. And it's a way that fosters that connection over shame. And it shares a snack instead of an infographic. Or a shocking piece of media. Now, I'm going to be real real with all of you, because I would never not be real real with you. Some people are going to be salty. Laughter And that's just the way it goes. We don't get to choose the pace at which people change, if they choose to change at all. But some people will be sweet. They will appreciate you for meeting them where they are, for sharing a snack and a smile, and maybe you extending that bit of compassion to them will make some big changes moving forward in their life. And who knows, maybe next time they'll be gutsy enough to try acorn cheese or something. So share that snack and make that memory. Thank you all so much for coming to my talk. Happy snacking. Don't die. Laughter It's clear that the COVID pandemic has had a tremendous impact on the way we work and live. Today, more employees than ever before are working remotely, and office spaces are being underutilized on a regular basis. New research from Columbia Business School's Stan Van Neuwerberg, NYU's R. Pete Gupta, and Columbia's Vrindu Mittal explored the impact of these shifts. They found that New York City office values declined by 45% in 2020 alone, with an expected 39% decline in the longer run, representing a $453 billion value destruction moving forward. What does this mean for the future of commercial real estate and its value? How should we think about urban planning and design amidst these changes? What are the repercussions on local public finances and financial sector stability? Learn more about this research and its implications, and find new insights on the future of business at Columbia Business School's website, cbsinsights.biz. Congratulations on finishing your TED Talk. I have exited the red circle. You've exited it. How do you feel? Amazing. If you could bottle immediate post-TED Talk feelings, I would drink a bottle of it to get my morning started every day. Wow. Yeah. Well, tell us a little bit more about you. How did you get interested in the outdoors in the first place? I am very lucky that both of my parents are very outdoorsy people, and that their parents were very outdoorsy people. My grandmother worked in the cranberry bogs in Massachusetts during the Depression, and I think she was very keen on my mom being in the outdoors on her own terms. And my mom then passed that down to me as well. So I'd spend my summers like gallivanting in the woods or swimming around in the ocean with a seaweed in Massachusetts, where my mom's family is from. So I've kind of never known a life not enjoying the outdoors. So let's talk a little bit about food. What is your favorite dish to make using primarily foraged ingredients? Oh, my goodness. This is such a... It's like choosing between children, and it's like you have a favorite, but you're not supposed to. Oh, come on. I'd say because it is springtime, I am obsessed with saucer magnolias. I grew up with a beautiful saucer magnolia in our front yard. They have these gorgeous, like, hand-sized white and pink flowers. They're one of the first trees to bloom in the spring. Almost everyone's neighborhood has them. We love them as ornamentals here in North America in particular. But you can eat them. But you can eat them. Their petals are very gingery. Some of them even skew a bit citrusy. I love pickling magnolia petals. They end up being very sushi ginger adjacent. Oh, interesting. Yeah, I can imagine that. Yeah. And so it's a nice, quick recipe that I feel like anyone can do, but I also love making magnolia snap cookies as opposed to ginger snap cookies. They are fantastic, and I only get to make them for like a two-week period each year, and it's now. Oh, that makes me hungry. I'm so sorry. Okay, so people who are inspired by your talk might want to start foraging. Yes. How do people kind of just get started so that we are not accidentally, say, ingesting pesticides, choosing the wrong mushrooms? Yeah. So in descending order, I would say the best thing that you can do is go out with someone who is familiar with those spaces and can slowly, like as you learn, help you build up that knowledge. If that is not an option, I would join a local foraging Facebook group. So you get a lay of the land, and there's a ton of people there to answer any questions that you have. And then after that, I would buy a local foraging guide, as local as you can manage. Sometimes you can only manage a regional one. Do that. And there's another there's an application called iNaturalist, which I am obsessed with. It is such a beautiful tool of citizen science. Just open the app and look at your area and see what other people are looking at. It is just such a helpful way to even understand the environment that you're in, whether you're in a new city or in your hometown. It helps reveal how biodiverse even our city spaces are. And I think it just makes your world seem a little bit more magical when you are aware that all of these different organisms are a stone's throw away from your house. Yeah. You talk about lasting change. There seems to be a renewed interest in foraging and reconnecting with nature, especially after the pandemic hit. Oh, yeah. Do you think it's a trend or can it be a sustainable way of being and living for us? I would not say I think every single person in the world could immediately turn to a forage diet. One, foraging is very time consuming. Everyone would have to leave their jobs. We'd all be out in the woods, hunched over, picking our food. But I see foraging outlasting the trend mostly because it already has. All of our all of our ancestors forage. If you are alive today, someone in your lineage forage to make sure that you are. It's kind of like one of our oldest hobbies slash necessities and traditions. Right. All right. Where can folks find you? You can find me on a tick tock at Alexis Nicole. And that is Nicole with a K. Thank you, Mom. And you can find me on Instagram at Black Forager. Fantastic. Alexis Nicole. Thank you so much. Thank you so much for having me. This has been a blast."
    },
    "podcast_summary": "In this TED Talk, foraging enthusiast Alexis Nicole Nelson shares her passion for finding delicious foods in nature and discusses her life as a vegan. She emphasizes the benefits of foraging for wild food and highlights the nutritional value of plants that are often overlooked, such as purslane and seaweed. Despite the challenges of introducing people to new foods, she provides tips for getting skeptics to try wild vegan dishes and advocates for a more sustainable approach to eating. In a post-TED Talk conversation, Alexis discusses her love for the outdoors, her favorite recipe using foraged ingredients, and offers advice on how to get started with foraging. She also discusses the lasting impact of foraging and its role in reconnecting with nature.",
    "podcast_guest": "Alexis Nicole Nelson",
    "podcast_guest_details": {
        "Guest Name": "Alexis Nicole Nelson",
        "Guest Job": "Foraging Enthusiast",
        "Guest Fame": "Preparing sweet and salty kelp chips live on stage at TED 2022",
        "Guest City": "North America",
        "Guest Website": null,
        "Guest Media": "Alexis Nicole - Tiktok, Black Forager - Instagram"
    },
    "podcast_highlights": {
        "highlight_1": "Foraging is the art/science of identifying, collecting, and eating wild food.",
        "highlight_2": "Foraging allows us to find free, nutritious food that is often healthier than store-bought produce.",
        "highlight_3": "Seaweed and sea vegetables are future-minded foods that are sustainable and packed with nutrients.",
        "highlight_4": "Introducing people to wild foods fosters their connection to their food and encourages more thoughtful choices."
    },
    "podcast_score": {
        "score": "4",
        "review": "This podcast talk by Alexis Nicole Nelson was informative and engaging. She shared her passion for foraging and veganism, and provided tips on how to introduce wild vegan foods to others. The talk was well-presented and had a good balance of humor and valuable information. I found myself intrigued and inspired to explore foraging and try new plant-based dishes. Overall, a great episode that deserves a score of 4."
    }
}