{"podcast_details": {"podcast_title": "The 10 Minute Entrepreneur", "episode_title": "MENTORING: Setting Goals the RIGHT Way.mp3", "episode_image": "https://s3.castbox.fm/86/48/a5/445635130eace94a22f089013972bec29d_scaled_300.jpg", "episode_audio": "https://pdcn.co/e/traffic.libsyn.com/secure/seancastrina/ubnoinoiono_mixdown.mp3?dest-id=624318", "episode_transcript": " Welcome to the 10 minute entrepreneur podcast intended to equip and encourage business owners and aspiring entrepreneurs taught by active business owner, bestselling author and teacher, Sean Castrina. All right, let's jump into it. I want to reward the people that are on time and not, you know, people come a little late. I understand that, but let's get started. This is mentoring. What I'm doing today, this is mentoring for you. Again, this is if I was one-on-one with you and we were having coffee and I could help you, if I had 20 to 30 minutes to help you achieve at the next level, what would I do with it? Well, I think the ability to set and achieve high level goals is what separates successful people from unsuccessful people. It's New Year's and I can't imagine how many New Year's resolutions are set for today. People are going to lose weight, but they're not going to lose weight. Why are they not going to lose weight, Sean? Because they're going to cheat on their diet within the next 24 hours or in the next seven days. Well, why do you know that? Because statistics say they will. Now, I could tell you what they could do to increase their odds, but that's with everyone. So we're all going to set goals and how are we going to achieve them? Anybody who's listening to me, I think you have a goal to either start a business or grow a business or at least develop into the type of person that when a business idea hits you, you can take action on. I tell people that are in college, I go, start turning yourself into the right person. See the right person will succeed in a business, even if the first one doesn't work. And that's possible. If you take the steps that I teach you, it's not going to be the end of the world because I always tell you, start a micro business first, start a fraction of what the end business looks like, start with a fraction of the cost, get some traction. So again, I'm talking to people that want to start a business today, people that are trying to grow their business, maybe their business is struggling or somebody who knows they want to be an entrepreneur in the future. And if I could help you more than any single thing, you know, other than coming up with a business idea for you, I think it would be teaching you how to set goals. I was reviewing my goals today and I'm just going to tell you how I do it. And then you can apply it to your life. The first goal I try to set is a goal that I am. In other words, who's Sean Castorino? Like what, you know, what's the one fundamental thing that I want to achieve? Because if you know what you really want to be, it'll dictate your goals. So my fundamental core, my purpose, what I want to do is I want to teach entrepreneurship to more people on planet earth than any other person on planet earth. Well, Sean, that's highly ambitious. Absolutely. And anything else would be disappointing. Well, how do you achieve? That's a massive goal. How do you achieve it? Well, one thing that I do that's different than everybody else, if you listen to my podcast, I actually teach. Because what do I tell you? Education without education is worthless. You can run as fast as you want. If you're aiming in the wrong direction, you're never going to win the race. So unlike a lot of other podcasts, which are great, they motivate you and they tell you about their lifestyle and their rich and their this or that, and they have great guests to tell you that. Even if I have a guest, I extract from my guests entrepreneurial advice. You know, what's the one piece of startup advice you would share with somebody? That's a core question. Because in that podcast, I want you to learn. So let me go back to this. What is your like overriding? Where do you want to see yourself 10 years from now? See, that will get your goals going. So think about that. I had a goal at some point to be a business owner. So as passionate as I am now about teaching entrepreneurship, I had a passion about being a successful business owner. Why? Because as a successful business owner, I would have flexibility of schedule. I have potential to make a significant income. I could work as you know, I could own other businesses. I could create teams. So that was a big that was my vision. Again, we're talking about how to set goals and mentoring you on how I set goals. The first thing I want to do is kind of decide what I'm trying, you know, in a sentence, what am I trying to be? When I had a goal, you know, in high school, I had a goal to be a high school state champion. Now, I wrote this down in my Bible and Sunday school class, my senior year, October 25th of my senior year, I still have that win state championship. Well, when I set that goal, it dictated how I would, you know, what I would do for the next year. Instead of, you know, when other people were sleeping, I ran three miles every morning. When everybody was watching TV after dinner, I went out and ran another couple miles, ran five miles every day. Well, how did that work out? Well, guess what? I was a state champion. I met a person who had never lost before and got a Division I scholarship to college. And that set a lot of great things in motion. But what was the primary vision, the primary goal was who I wanted to be. I wanted to be a state champion. Then I wanted to be a business owner. And then, you know, it kind of escalated at that point. I wanted to be somebody who had businesses of this worth. And now the simple vision, I think it'll be the vision for the next decade. It'll be to teach entrepreneurship to more people on planet Earth than anybody on planet Earth. And so that consumes me. So how can I achieve that? This is how we do goals. So we set this big goal. It's motivating. Well, now I kind of got to go into my how. Because this is what happens. We set goals. We have this vision, but the problem is, is that it doesn't align with our effort. It doesn't align with our habits. It doesn't align with our talent. And it doesn't align with the sacrifice we're willing to make. Think about this for a second. Okay. I want to be a state champion. That's the vision. All right. Well, let me ask you this. Now I have to, when I look at this, I have to decide, is this, am I truly willing to put the effort required to be a state champion? Okay. If you want to be an entrepreneur, this is where it frustrates me when somebody says, oh, I don't want to do a business plan. Okay. You're lazy. Forget the business plan. Even though I think it pays off and it'll save you tons of money and tons of time. But when you tell me that I would come back to you and say, your effort does not align with your vision. A vision is your goal. And again, we typically have one overriding goal. That's when we're kind of talking about, we're going to drill down on some other things. I literally wrote this lesson one minute before it started. I had a lesson already drawn up that I did on Monday, but it hit me. I was like, where, where, where can I help them the most? Sean, what, what you do that's unique is your ability to set and achieve massive goals. I think that's with anybody successful. But so I have my vision. Again, it was to be a state champion. Okay. My vision, think about it. I wanted to be a successful business owner. Well, my effort, I worked a job while starting a business. I don't ever remember taking a day off unless we went out of town. Let me say this again. I don't ever remember taking a day off before the age of 38, unless we were outside of our city. Never. There was never a day where I didn't do something in the course of that day that didn't involve my business or the success of my businesses. Never. Because see, I had a vision and that vision aligned with the effort. I was willing to put the effort to achieve it. Next, what are your habits? This is where we got, we were talking about somebody losing weight. Well, your habits will always, this problem is they should. So let me rephrase that. Your habits, your daily habits need to align with the vision, your goal. Example, if my goal is to be an author and that was a goal at one point, that was my vision, I wanted to be a bestselling author. It's funny because I don't even like signing birthday cards at the time. I still use the word then, THEN or THEN. I use it wrong every time in a sentence. I still can't figure out where to put a comma half the time. Yet I'm getting ready to drop my fourth book. How? Well, I set a daily habit when I first started, I was going to write for 20 minutes every single day. My goal was to basically write a page. Now going back to being a state champion, my habits were I ran five miles a day. I saw that paid off. When I wanted to be a business owner, my habits were being maniacally focused on delivering what our customers wanted. That dictated everything. When I was interviewing people, I wanted the most talented people. My habits changed. In most companies where you delegate hiring, I am always involved in hiring. I'm involved in hiring to this day because my habits will typically dictate the results. I don't need to be in those, but I know that I will do a better hire than my partners will or at least the collaboration on them. It doesn't mean I'm on the front end, but on the very end, I like to be involved in the interview. I like to instill what our brand is, what our customers expect of us. Again, we're talking about this big vision you have. What I'm trying to get you to think about right now is what's the one thing? We're just going to just really focus on that for a few minutes because this might end up being a two-part lesson. It's going to be that good. I want you to just go, I am, and fill in the blank, what is it? I am a very successful entrepreneur. I am a new business owner. I am a college student who owns a business. Whatever it is, write that out. Write that out. It's got to consume you. I still have a statement I say every single day, and it dictates my habits. It dictates my effort. Every single day of my life, I am a very successful entrepreneur, a bestselling author who has sold and given away more than 1 million books. 1,000, that'd be a little bad. A million books. There's a highly sought after speaker, teacher, and coach who has shared the stage with those whose books he's read and those he's admired. That is something I say every day. That's kind of my I am. That was for a long time, and now my new one is where I shared with you about teaching entrepreneurship. I want you to have something like that because that's going to motivate the heck out of you. It's going to give you focus. All right, so you have your vision. We talked about that. All right? That vision typically needs to align with your purpose. That should kind of go hand in hand. It's hard to get excited about something that you have no interest in, you're not excited about. Needs to align with your effort. If you have a big goal and you don't apply any effort, it's never going to happen. Then I talked about you should have habits that make this goal a reality. So if you have a big goal, there should be habits. You should be reading books about successful entrepreneurs. You should be listening to podcasts about business. Okay? You should be consumed with that. Habits. All right, next. Where's your talent? Do you have talent that aligns with any of your goals? I have a lot of deficiencies, things I'm not really good at, but I'll tell you right now, where I'm strong, I'm very strong. And I partner with people who fill in the gaps. You can't have a vision for something that you have absolutely no talent for. I could set a goal to, I don't know, sing the national anthem at halftime at a sporting event and I could probably pull that off at a local event. Remember the guy who did it in that movie? I forgot what's his name. Golly, the funny, what's that? What's that movie we watched, Colin? Oh, the guy we just watched it about a month ago and he sang it at the Salem Arena. Borat, there we go. Borat. Okay. He even got to do it. The point that I'm talking about is, yeah, it would be a disaster. How motivated could I possibly be to do something I know I'm not very good at? What's the likelihood of me succeeding at that at any grand level? No. My brain would reject it because it knows that I'm not talented in that. So if you have this vision of what you want to achieve now, and especially if you're sub-25, I mean, I didn't start this till I was going on 40. You got to start developing a skill and a talent in some area and don't let it be all the way across the board. You don't need to be talented in 20 things. Be talented in less than three. Be extraordinarily gifted in those areas. That's what you eat, drink, and sleep. That's what you read about. You're fascinated by branding. Read books on branding. Listen to podcasts on branding. If you're fascinated by drop shipping, well, then you should watch everything on YouTube about it. Whatever it is, again, we got this big goal. Remember, I have this vision of what I want to achieve, of me, and that's going to set out all these minor goals underneath of it, but I don't want to complicate it. So I'm just trying to get you focusing on this big thing. And then I ask you, okay, you got this big goal. Does it align with your purpose? In other words, are you passionate about it? Are you excited about it? Does it motivate you? Is it aligned with your effort? Is it aligned with your habits? Is it aligned with your talent and skills? And then finally, what sacrifices are you making to make it happen? I mean, don't tell me you have a vision for something great and you're not willing to make any sacrifices. My sacrifices, I worked a little bit of every day until I was 38. That's when I got rid of my direct mail organization. I had a magazine and started focusing on some different things that gave me more flexibility. So again, what we're talking about, we're going into 2021, I want you to be so successful. And the first thing I want to teach you is, so how do you accomplish that one big main, main, main thing? That's the I am goal. And mine has changed over my lifetime. It was, I am a state champion. I am a college graduate because nobody in my family ever graduated from college. So that dictated some things. I am a successful business owner. Okay. Then it was, I am a millionaire. Then it was, I am a bestselling author. Now it's, I teach entrepreneurship to more people on planet Earth than anybody on planet Earth. And what, A, it aligns with my purpose. I have daily habits. Every single day I study for an hour so that I have enough material to be able to offer a podcast every single day and to be a guest on more than 200 podcasts a year. See if you're, if my podcast is seven days a week where the typical podcast is once a week, well, I've got a seven to one ratio that naturally is going to give me an advantage. Well, if I'm not only teaching on my podcast, but I teach on four podcasts a week of other people, just pure volume, we've got 365. Now let's add those 200. So I'm going to be teaching entrepreneurship 565 times. Wait, now we add the Facebook group. That's another 52. Looked over 600 exposures of teaching every single year. Nobody's at that volume where they're teaching. Some people are motivators. Some people are personalities. Some people do interviews, but where every single time I am listened to in any five minute period, I am instructing somebody on something to do with entrepreneurship or being a great entrepreneur. So that's how you set crazy goals. But more importantly, I just shared with you how you achieve them. You got to have a few things that align. Okay. You got your big goal again, we're just wrapping this up. I'm going to go to something else that I think will help you. Okay. Your, your goal has got to align with your purpose, which is your passion. It's got to align with your effort. It's got to align with your daily habits. So what, what, look at your habits today, look at your habits for the next week, the next month. What habit do you have that's going to make you better at what we're talking about? Tell me if you don't have some daily habits, then it's not going to happen. All right. Tell me this. What's your talent? What is going to be your talent within business? Is it going to be marketing? Is it going to be developing staff, identifying talent, creating systems, helping companies expand on the visionary? You better be more than a visionary. Steve jobs is a visionary and he was brilliant. Elon Musk is a visionary and he's brilliant. Okay. So you got to have talent, you got to develop a talent. What sacrifice are you willing to make? If you're, you know, if you're not sacrificing anything, no big goal will happen. All right. So that was the big goal. If you're not ready to, you know, rush hell with a squirt gun right now, I have failed. This system works for all your goals. Now let's just take it further. Set a fitness goal. I am 20 pounds lighter. I am 10 pounds more muscular. I whatever it is, this system works for every goal you can set. Do you have relational goals? Okay. I have a blank, blank, blank, blank, blank relationship with whatever. Okay. It's going to dictate everything. Are you putting effort into it? Do you have some daily habits that make it better? What are you willing to sacrifice for it? That means when they ask you to do something, you know, you don't want to do it. You shut your mouth and do it because it requires a sacrifice. What are you getting better at? Are you getting better at communicating better at listening? The formula I gave you works for every area of your life. I want to be better at my career. Let's look at it. Okay. Okay. What effort? What are you developing? What skills are you developing to be better at your, do you take seminars? What habits have you instilled? I get to work a little bit earlier. I stay later. What sacrifices do you make? You know, I offer to do other people, whatever. I'll do two jobs if I need to. It just, that formula works and it'll work in everything you're doing. So as we go into 2021 and I'm mentoring you on how to set goals, and I kind of just gave you my blueprint, this will work in everything. So you can just go all the way down. Financial. Okay. I am financially secure or I am more disciplined with my finances and I've saved $10,000 this year. Okay. Let's say that's it. Well, okay. It's going to, what effort are you putting into it? What habit? Well, I'm going to put away this amount of money every single week. It's going to require a sacrifice. I'm no longer going to do A and B that cost me money. Okay. So it's always going to involve about, you know, four to five of those things that I mentioned. Some goals may not involve every single one of them. There's always going to be a sacrifice. There's always going to be a habit you need to develop. It's got to be something that motivates you."}, "podcast_summary": "In this podcast episode, entrepreneur and author Sean Castrina discusses the importance of setting and achieving high-level goals. He emphasizes that successful people separate themselves from the rest by their ability to do so. Castrina encourages listeners to think about their own goals, whether it is to start a business, grow an existing one, or develop the skills to be an entrepreneur in the future. He emphasizes the need for alignment between goals and purpose, effort, daily habits, talent, and sacrifices. Castrina shares his personal examples of setting goals throughout his life, from wanting to be a state champion in high school to teaching entrepreneurship to more people on the planet than anyone else. He concludes by stressing that the goal-setting formula he presents can be applied to any area of life, including fitness, relationships, career, and finances. Overall, the episode offers practical advice and motivation for achieving ambitious goals.", "podcast_guest": "Sean Castrina", "podcast_guest_details": {"Guest Name": "Sean Castrina", "Guest Job": null, "Guest Fame": null, "Guest City": null, "Guest Website": null, "Guest Media": null}, "podcast_highlights": {"highlight_1": "The ability to set and achieve high level goals is what separates successful people from unsuccessful people.", "highlight_2": "Setting a clear vision and purpose is important in achieving goals.", "highlight_3": "Effort, habits, talent, and sacrifice should align with your goals.", "highlight_4": "The goal-setting formula can be applied to all areas of life, including fitness, relationships, career, and finance."}, "podcast_score": {"score": "4.5", "review": "I really enjoyed this podcast episode. Sean Castrina provides valuable insight on how to set and achieve high level goals. His personal examples and practical tips make it easy to understand and apply to one's own life. I appreciate his emphasis on aligning your goals with your purpose, effort, habits, talent, and sacrifices. Overall, a motivating and informative podcast talk."}}