{"podcast_details": {"podcast_title": "THE ED MYLETT SHOW", "episode_title": "How To Let Go Of Toxic Relationships.mp3", "episode_image": "https://image.simplecastcdn.com/images/468ed00d-ff67-463e-b4c2-9226dc0ada75/8b8653e0-5f6b-4493-9a94-3169b7f96926/3000x3000/em-sept-solo-episode-19-em-2-0-pt.jpg?aid=rss_feed", "episode_audio": "https://pdst.fm/e/stitcher.simplecastaudio.com/eb066caf-b4e0-4cd2-8a27-575be186c955/episodes/62bc33c1-0c07-49ba-b354-038be93de548/audio/128/default.mp3?aid=rss_feed&awCollectionId=eb066caf-b4e0-4cd2-8a27-575be186c955&awEpisodeId=62bc33c1-0c07-49ba-b354-038be93de548&feed=J2ZDFXoI", "episode_transcript": " Every second counts when you're a Formula One team. Whether on or off the track, seamless performance takes smart logistical preparation. As official logistics partner of the McLaren Formula One team, DP World delivers transformational global logistics, making sure they are always race-ready, in Asia Pacific and around the world. DP World. Smart logistics at every turn. You need help with. And so today's no exception. By the way, if you have something you want help with or a question answered, you can DM me on Instagram at EdMillette, and there's a chance to lend up on the show like I did today. Today's question is all about change, which is a really interesting one, except not change of oneself, change of another person. So this person's question was, can you please help me change my spouse and the way they behave? Let me be very clear with you. No, I can't. And more importantly, neither can you. So many of us, and I'll put myself included in this, we are wasting so much time, effort, and energy trying to get another human being to change when they're not going to. They're certainly not going to change for you. If a human being is going to change their behavior, they're going to change that behavior because they choose to, because they want to. And no cajoling, no threatening, no encouraging is going to get another human being to change on your behalf. And so so many of you are wasting energy, focus, and time with somebody who is not going to change. And so you need to decide. I'm not saying that you don't want people to treat you in a way that you deserve or that you're worthy of. That's not what I'm talking about here. What I am saying is they're probably not going to change. And so there's two things you can try to do in your life. You can waste all the energy you have trying to change this person, or you can just change the person. In other words, maybe it's time you not be with this person anymore, or accept the way they are. Now, if they treat you in a way that's not worthy or what you deserve, then you should leave. But wasting energy, all the different things we do, don't we? We try to prod and we try to threaten. Someone's treating us in a way. Think about all the things we do. We're not giving them the cold shoulder. We'll threaten them. We'll try to encourage them. Whatever the thing is that you might do. Has any of it worked for the long term? Not the short term, the long term. People will eventually reveal to you who they are. And when they do, wouldn't it be more prudent to either accept the way they are, if it's worthy of you and you deserve it, or to leave, or to leave? Are you so afraid to be alone that you're willing to stay with somebody over and over again who mistreats you, or treats you or behaves, or treats themselves? Maybe they do things where they treat themselves in such a way. It's just terrible. And you watch this happen over and over again and it hurts you. But yet you stay with them. You have to ask yourself, why do you stay with them? You've already, you know they're not going to change, right? You keep trying to do a different tactic or a strategy, or give them a book or something. They have to decide this on their own. Listen, I know that when my dad was drinking, and I've had other friends of mine that have had substance abuse issues in their life, there's nothing you could do. You can't create a word game to get them to change. They have to hit a place in their life where they decide they're going to change. Human beings have to make that decision themselves. And so all the games we play, the cold shoulder, the I'm not going to talk to you, I'm going to step away for a while, you're going to threaten them, whatever it is, it doesn't work long term. And what happens when you're constantly trying to get somebody to change, let me tell you what ends up happening. They resist you, they rebel against you, and they resent you, the three Rs. And so the more you try to get them to change, they resist, then they rebel, and they resent. And then it almost feeds the behavior that they're having. You know, one of my greatest strengths in my life is I see somebody as they're capable of being. And I love them and I believe in them. And it's been one of my great strengths in my life. It's also been one of the great weaknesses and one of the things that's been used as a weapon to hurt me, that I see them as they could be. And that's what you want to do as a leader in business or as a parent or as a friend, is see somebody as they could be and try to get them to live up to a particular standard. But at some point, someone has shown you who they are. They revealed to you at least who they are now. And so many of us stay in a relationship with somebody, haven't you? Many of you listening to this are watching it. And the real reason you're staying is your own lack of self-worth, your own lack of really believing what you deserve. You would rather be with someone who behaves in a way that either doesn't treat you well, isn't worthy of themselves, they don't treat other people well, maybe all of the three or one of them. And the reason you stay is you'd rather have that than the fear of being alone because maybe you think you can't do better or get someone else. And so maybe the problem isn't with this other person. Maybe the issue is with you. And so please stop trying to get other people to change. It's not going to happen. They have to live their own lives, make their own decisions, their own mistakes. And they need to deal with the consequences of those choices. And potentially, maybe one of those consequences is that you're not around in their life anymore. Maybe they're going to suffer the consequence of you won't be quite as close to them anymore. Maybe you won't be close to them at all. Maybe you just won't be around them as much. This could be a friend. This could be an intimate relationship in your life. Or maybe it's somebody even that you employ. So you can't be so concerned that you're going to be alone that you begin to waste all your energy. It's debilitating. You're going to be waiting for a long time, by the way. If your happiness is contingent on your environment, or your happiness is contingent on the behavior of other people, if you have surrendered your own happiness to another human being, and their choices, and their behavior, and how they have to conduct themselves in a way that you see fit in order for you to feel happiness and love, boy, you're taking a big risk in your life and you're wasting a lot of energy. And so sometimes you just have to say bye-bye, or create distance, or just make the decision that it's okay to be alone, or if someone works for you, maybe let them go. I think there's only so many times you can ask somebody to live up to a standard or a behavior, or hold them accountable, or threaten them, until at some point all you're really doing is criticizing them. And all you're really doing is creating toxicity in your life and in your relationship with this person. And so there's a lot of reasons why I don't think nagging somebody, getting on them, giving them unwanted advice, stress, conflict, all that stuff, it just negatively impacts human beings and their relationships. And when we try to fix, change, rescue people in our lives over and over again, we're really assuming that we know what's best for them. And really what we're really probably trying to do is we really know what's best for us. And so are you really trying to get them to change so that they'll be happier? Or are you trying to get them to change so that you'd be happier? This is a point of reflection for so many of us. And most of us spend most of our lives trying to get the person around us to behave differently. And we set up these expectations where they constantly are letting us down. Rather than just making one of two choices, I accept you as you are, or I don't. If I accept you as you are, I'm going to encourage you to grow and improve. And there's obviously in life, there's a particular standard that someone must treat us that we're worthy of and that we deserve. But if someone consistently doesn't live up to that standard, why are you wasting all this energy at this one person to change, this one human being to change, when there's 8 billion other ones? And then what you got to do is you got to tell yourself, why am I so reliant on this person for my happiness? Why am I so dependent on the conditions of how they act based on my own bliss? This is something that's a very dangerous place. And what happens is we become more resentful, we become more frustrated, then we behave in a way that's not worthy of us or reflective of how we should conduct ourselves. And now we're not treating that. And now it's toxic. Rather than just make one of the two choices that I've suggested. When we get distracted from solving our own problems and issues, and we spend all of our time trying to solve another person's problems and issues, we've depleted all of our energy and now we're not growing ourselves. And by the way, word to the wise, because you listen to my content, because you listen to programs like this, it means you're addicted to growing. You're addicted to improving yourself and expansion of your being and becoming a better version of you and all of these things. If you're not with someone who is also that way, that's okay by the way. But trying to get them to be like you will just create more distance between you and them. I think it's okay that if in a relationship you're growing and expanding and changing, and the other person is rather happy the way they are, I think those two people can coexist. I think it's fine. Now do I think it's best if there's two people sort of running together and I'm growing and expanding and you're growing and expanding, and we're heading somewhere? I do think that's best. But I also believe that it works where one person's like, hey, I'm not satisfied with who I am. I'm changing and growing and evolving. And the other person's like, I'm actually pretty satisfied. I like my job. I like my life. I like my emotions. I'm okay. That relationship can work as well. What won't work is when one resents the other one because they're not like them. And you want them to change the way they act and conduct themselves, not based on their own happiness probably, but based on yours. So just take a quick look, a long look, if you will, and just decide is this the right person in my intimate relationship? Is this the person who should be my close friend? Maybe they should be a distant friend. Maybe they should no longer be my intimate partner, but someone that I consider a lifelong friend. Maybe they shouldn't be around me at all. If I employ this person, how many choices and chances am I going to give them before they just don't live up to the standard? And I've got to make a difficult decision. It's the difficult decisions that you need to make that are what matter. That's what matters. Instead of trying to make the easy one, which is just putting it off on them to change their behavior, I think you're being selfish when you're asking somebody to change against their own will. That's number one. Number two, I think it's exhausting. If this person is not interested or ready for change, you're putting out a whole lot of energy and a whole lot of focus and a lot of challenges in your life unnecessarily. And again, I want to reinforce this. You cannot get somebody to change. And what's going to happen is you're going to begin to be seen as controlling and that's not something you want. And let me tell you the other thing. You're going to lose. You're going to lose this battle. And if you're not careful, if you keep battling them about this, you're eventually going to lose this person. And maybe in some cases it's not necessary. If you go back to my dad when he quit drinking and other friends of mine that have quit a habit that didn't serve them or change their behavior, they have to reach their own conclusions. It's an indecisive habit. They have to reach their own conclusions. It's an inter change is an internal thing. They have to make an internal decision, not based on the external forcing of another human being and change in our lives. If you're someone like me who I'm constantly changing and evolving, and I am, it's hard for you to connect and relate to somebody who isn't. And you have to evaluate that. And then you just on your own terms, you have to go, I'm OK that they're not changing and evolving. And let's just be honest, you fell in love with that person the way they were. Is it really fair for you now to say, hey, I want you to be changing all the time? Part of them is like, well, wait a minute, I'm not the one who said I wanted to grow and change and evolve and increase. I like my life. I like the way that I am. One of the things we do in the personal development business is we judge people who don't change and grow. I've learned not to do that. I've learned to accept people as they are, if they accept themselves as they are. Now, if someone says to me, I don't like the way my life is, I want to change, I want to grow, I want to be better, and then they don't, well, now we've got a real issue. But I have a lot of people that are friends of mine that are like, hey, man, I love that you're always growing and expanding and changing, and I get it. I'm just not wired that way. And you need to accept me this way, or don't, but don't constantly be judging me and assessing me, and my gosh, it's exhausting for them as well, to always feel like they're under the microscope, that you're always watching them. And then what happens is, because they love you, they artificially try to change things in the short term, but people return back to their patterns. If your pattern is to grow and improve and expand, you're going to do that. If your pattern is you don't, you're probably not going to. And so sometimes you just got to say, bye-bye, bye. And that's the hard thing to do, and it's excruciatingly painful. And I'm not encouraging you to do that. What I'm encouraging you to do is one or the other. It's one or the other. Accept them or leave. And if it's leaving is the real painful thing to do, it's the more painful thing to do, right? But it's short-term pain. Long-term pain is to stay with somebody over and over and over again, who's going to let you down, who you're in conflict with, who gets your hopes up, your expectations up, and then doesn't meet them. And by the way, they're in pain, because maybe they love you and they want to be a particular person, but they're just not, that they just aren't. And if you suffer from this disease I have, where I always see people as I think they could be, it's so beautiful as a business leader to be that way. And if you're with the right person, they want you to see the better version of them. Listen, I know in personal development, we're constantly talking about getting people to rise to the standard, and getting the treatment that you deserve, and not just accepting somebody as they are, but demanding and requiring more of them. That's if that person wants to be required to do more, if they want to expand, if they've signed up for that agreement. But there are a lot of people in the world that aren't like you and I, that are relatively happy the way they are. They don't want to be richer. They don't want to be more fit. They don't want to expand their knowledge and their emotional basis. They're okay the way they are. Now I don't relate to that. I don't understand that at all, and probably you don't. But you either need to accept that they're that way, or you need to not be with them, because there's no word game, there's no cajoling, there's no cold shoulder, there's no threatening, there's no silent treatment that's going to get them to do it. There's no comparison where you tell them, well so-and-so's like this, or so-and-so's wife does this, or spouse does that, or husband does this, and you begin to compare them to another person. All of this is just this toxic soup of you trying to get another person to meet your conditions so you're more comfortable and happy. Maybe they're just the wrong person. Or maybe you need to just give them a break. And so today's message is just to have you reflect on this. And if you have any relationship like this, a work one, an intimate one, a friendship, eventually you've got to evaluate. And you know what probably the most powerful thing you could do is? Is to ask them, do you want to change? Do you want to grow? And be honest with me, do you want to get better? Do you want to expand? And it's okay if you don't, but please level with me. Rather than me constantly have these expectations that things are going to be different and then they never are or they only are short-term, just please be honest with me. And that way you can make your decisions. And so this idea that how do I get somebody else to change is a flawed premise and something that doesn't serve you. It's not going to work long-term. And the person, every single minute you're spending looking at this other person, how much they need to change, are minutes you're not looking at you. You're not looking inside. And by the way, sometimes I've found in my life is that as I've changed and evolved, it's created a space and a comfort level and a security and a safety for the people around me that they now can as well. And so the best thing I can do for this other person is to continue to run my play, play my game, live my life, and support and love them where they are. Meet somebody where they are, love them where they are. And again, if they're not meeting a standard of what you're worthy of or what you deserve or they're treating you in a mean way, a condescending way, a threatening way, an abusive way, get out, leave, do not be with them. If they're not honest with you and forthright, it's the wrong person. And it'd be better to be alone than to be with somebody that doesn't treat you in a way that you're worthy of and that you deserve. Stop trying to change them. It's killing you. It's taking all your energy. It's zapping you of all the juice of life. And life is supposed to be lived. And you were born to do something great with your life. You were also born to be in a relationship that's loving and blissful and kind. And if you so choose, growth-oriented and progressive and expansive, if you choose that, it's okay that you choose somebody who doesn't want to run the race with you, but supports you running your race and you support them running theirs. And again, I'm not an expert on any of these things. These are just words of hopeful wisdom from experience of a guy who's done some of it right and some of it wrong in his life. I hope today served you. You're better than this. You're better than trying to get people around you to change. You need to be the better version of you. And if they change and come along for the ride, great. And if they don't, they're going to get dropped off. And there's going to be somebody else on that ride with you. All right, everybody. God bless you. Max out your life. Please share today's episode with anybody that you care about, anybody that's in any sort of a situation like what I've described today, and I hope my words have helped you. Take care. This is the Ed Mylod Show. Every second counts when you're a Formula One team, whether on or off the track. Seamless performance takes smart logistical preparation. As official logistics partner of the McLaren Formula One team, DP World delivers transformational global logistics, making sure they are always race ready in Asia Pacific and around the world. DP World. Smart logistics at every turn."}, "podcast_summary": "In this podcast episode, the speaker addresses the topic of trying to change another person's behavior, specifically in the context of a spouse or partner. The speaker emphasizes that it is not possible or productive to try to force someone else to change. People will only change their behavior if they choose to do so themselves. The speaker advises against wasting time and energy in trying to change someone who is not willing or ready to change. Instead, the listener should consider accepting the person as they are or making the decision to leave the relationship. The speaker also emphasizes the importance of not relying on another person for one's own happiness and self-worth. It is important to evaluate one's own needs and whether the relationship aligns with them. Overall, the message encourages self-reflection, acceptance, and making difficult decisions for one's own well-being.", "podcast_guest": "EdMillette", "podcast_guest_details": {"Guest Name": "Ed Millette", "Guest Job": null, "Guest Fame": null, "Guest City": null, "Guest Website": null, "Guest Media": null}, "podcast_highlights": {"highlight_1": "Trying to change another person is a waste of time and energy.", "highlight_2": "People will only change if they choose to.", "highlight_3": "Resisting, rebelling, and resenting someone's attempt to change them only strengthens their behavior.", "highlight_4": "It's important to accept people as they are or make the decision to leave."}, "podcast_score": {"score": "4", "review": "The podcast talk by Ed Mylod raises an important point about trying to change another person's behavior. He highlights that no amount of effort or energy can make someone change if they don't choose to do so themselves. While it is important to expect to be treated in a way that you deserve, it is also crucial to recognize when someone is not going to change and decide whether to accept them or move on. The talk provides valuable insights and encourages self-reflection."}}