{
    "podcast_details": {
        "podcast_title": "Financial Feminist",
        "episode_title": "Financial Foundations #1: Building Your Money Game Plan.mp3",
        "episode_image": "https://s3.castbox.fm/20/4b/f9/900ab978d591e0da63ce417bc6a9b56187_scaled_v1_400.jpg",
        "episode_audio": "https://pdst.fm/e/chtbl.com/track/95538/traffic.megaphone.fm/ADL5081167734.mp3",
        "episode_transcript": " Welcome to Financial Foundations, a mini series of financial feminists brought to you by State Farm. During each episode of this limited series, we'll be tackling financial basics like budgeting, investing, debt, and what it really means to be a financial feminist to help you get on track no matter where you're at on your money journey. Through short, actionable episodes and simple homework exercises, I'll help you build a financial plan you'll actually want to stick to. Thanks again to our sponsor, State Farm, for making the series possible. Like a good neighbor, State Farm is there. Hi, financial feminists. Welcome. I am so excited to see you for a special edition of this show. We are so excited to welcome you to the first episode of our special series that we're calling Financial Foundations, and it's brought to you by our friends over at State Farm. We're going to be doing these really short, actionable episodes as a curriculum of sorts. A lot of our questions we get are just like, how do I get started? What do I do? How do I figure out what to do next? So over the course of these next few months, we're going to be releasing seven episodes, each touching on a different part of the financial foundation, whether that's budgeting, paying off debt, investing, and of course, what it really means to be a financial feminist. These are going to be these quick, actionable episodes, perfect for getting energized and excited about your finances. And each episode will go through one personal finance pillar, and we'll end with a little bit of homework for you to do between episodes. We're all about actionable advice here. We're going to be following along pretty closely to my book, Financial Feminist. This is kind of where we took inspiration. So if you want a copy of my book, go ahead and pull it because this is a great book club guide almost, a companion guide, let's say. And if you don't have a copy of my book, herfirsthunderkid.com. You can go there. There will be even more in-depth homework and insights in the book itself. We're diving deeper there. This series is here to help you untangle your finances and get started wherever you are, whether that's overwhelmed with paying off debt, trying to heal your relationship with money, trying to navigate the stock market and maybe potentially start investing, or just figuring out how to spend in alignment with your values. Once again, a huge thank you to State Farm for making this series possible. This is a great series of episodes to share with your friends and family, and maybe even want to start a little financial accountability club with friends while you work through each episode. We've had folks do that before to great success. It not only keeps you, of course, accountable, but also it's just a great way to start having conversations about money with people in your life that you care most about. So let's go ahead and get into it. First, we're going to start with a journaling exercise. If you want more detail about this journaling exercise, again, it's in chapter one of my book, Financial Feminist. But one of the most important things we can do when we're starting on our money journey is delving in to not only our emotions around money, but how we were raised around money. So if you can grab a pencil and paper, if you can open up a Google Doc, if you're on your phone, maybe just open up the notes app. And I want you to think about the first time you ever thought about money. What is your first money memory? What is the first time that you remember knowing what money was, wanting money for something, or just thinking about it in general? Was this money memory positive? Was it more negative? Or was it neutral? My second question for you is what messages might you have internalized about money from this memory? What sort of conclusions did little you come to about money, about people with it, about the pursuit of money, because of the memory you had? And finally, what is your family like with money? Your parents, your guardians, the people around you, what was their relationship with money like? Were you surrounded by conversations about finances and investing and how to? That was me, which was 100% a privilege. Or was money this taboo subject that was never discussed? Was money a source of joy and pleasure and ease? Or most likely was money a source of anxiety and stress? Because maybe you didn't have enough of it. Are you carrying that into your life right now? This perspective about money that came from your family, that came from your childhood, are you still carrying that into your life now? And my follow-up question to that is do you even want to? If your parents or family don't have the best relationship with money, and maybe you don't have the best relationship with money, how do you want that to actually change? Do you want to carry that feeling of anxiousness or fear or shame about money into your life right now? To review this journal and exercise, what was the first time you ever thought about money? Was it positive? Was it negative? Was it neutral? What is your first money memory? Second, what messages or conclusions might you have internalized about money from this memory? And finally, what is your family like with money? Were you surrounded by these conversations about finances and investing and good financial decisions? Or was money this taboo subject? And if you're carrying that into your life right now, do you even want to? By starting to understand how we grew up around money, our current emotions around money, we can start to understand not only our relationship with money, but how we might be showing up in different spaces. Maybe that's in conversations with our romantic partner. Maybe that's in fear around asking for a raise or negotiating for what you're worth. Or maybe that's a lot of shame and fear that you just didn't know any of this sooner. Keep in mind as we go throughout this entire series, just keep these questions in the back of your mind. And again, I want to remind you, these are not questions to make you feel shame or judgment. These are just mindfulness questions to start understanding your relationship with money better and how you might want it to change. Let's talk about some of the actionable steps that you can do next. We talk a lot at Her First 100K about the financial game plan. In fact, chapter three of my book is literally called The Financial Game Plan. The financial game plan is based on your values and your goals. It is what you're doing financially in what order. This is the biggest question we get asked at Her First 100K and Financial Feminist is, okay, I have student debt, but also don't I need an emergency fund, but maybe retirement at some point, but maybe I want to buy a house? It all feels overwhelming. So using the financial priority list, we're going to tell you what to do in what order. Your first priority, no matter how much money you do or don't have, no matter how much money you do or don't make, is an emergency fund. This should be at least three months of living expenses in a high yield savings account. Again, more in my book about this, but the reason we do an emergency fund first and prioritize that first is one, I don't want you going into more debt trying to pay for an emergency because one will inevitably happen. And two, we prioritize mental health here at Her First 100K. And the last thing I want is your head to hit the pillow every night and your stress about how to afford an emergency. There's so much weight that's off your shoulders when you know that you have even just a little bit in savings should something happen. Now your emergency fund is, you guessed it, for emergencies. That's not like that hot pair of shoes that you really, really want when on sale. It's like you get sick, your cat gets sick, you lose your job, you get laid off, you get a flat tire, right? These things that actually constitute an emergency. That is your number one financial priority. Once your emergency fund is fully funded, we're going to start paying off our high interest debt. This is all credit card debt. A reminder, and we'll talk about this more in another episode, that credit card debt is typically some of your highest interest debt. It is anywhere from 15 to 30% interest. So we want to prioritize paying that off first. Our third priority is to start focusing on investing for retirement while paying down our lower interest debt. Typically lower interest debt is student loans, mortgages, and car loans. But we want to prioritize our investing for retirement because time, as you may have heard on this show, is more important than the amount of money. We want to get started investing as soon as we possibly can, even if it's just with a little money. And finally, our last priority is what I call the big stuff. This is saving for a house, saving for a wedding, maybe retiring early, starting a business, having children, right? These like big life goals that require some savings. This is what we do in what order. If you're lost and you're stressed about how to put an actual plan together when it comes to your finances, this is your order of operations. Emergency fund, high interest debt like credit card debt, investing for retirement while focusing a little bit on paying off that lower interest debt. And finally, the big stuff, the big life things that you need to save for. All right, number three, as part of this episode, getting comfortable talking about money, knowing more about money means getting honest about your money. I always say that it's really important that we get comfortable being uncomfortable. Growth does not happen when we are comfortable. We're not comfortable with being uncomfortable. And if you have done the Nick Miller from New Girl thing of putting all of your bills in a box in the closet, or if you've done the thing like Andy and April on Parks and Rec and put all your bills in a freezer and you're just like, no, I'm not going to look at them. That's what we call the ostrich effect. And it is very common. It is very, very normal. But the way we start getting better with money means actually getting honest about our own money. So how do we get to what's called a money date? I talk in chapter seven of my book about this money date as financial self-care. Financial self-care means taking a period of time. I like doing it once a month on a Sunday night and looking at my money. It's a designated time to make financial decisions and to also look at my money. How do we have a money date? First, we're going to write down all of our accounts. We're going to write down our checking account and how much is in there, our savings account and how much is in there. We're going to look at our debts. We're going to look at any major bills. We'll get into spending and budgeting more in the next episode, but I want you to write it all out and see where you're at. So first, we want to write down all of our accounts, figure out where we're at and get honest with ourselves about where we're at. Two, we want to write down where we want to be. We want to get specific about our goals. Not just, I want to be rich, right? Like that's a great goal, but it is not specific enough. Very specifically, right, I want to max out my Roth IRA every year, or I want to become debt-free by my wedding or before my wedding, or I want to be able to travel three times a year. We're getting specific about what our life looks like when we are using money as a tool to build a life we do love. And finally, we want to find some sticky points. Once you have your finances in front of you, you need to figure out where these things feel challenging. Is it your car payment? Is it your student loans? Is your dining out budget just astronomical? The volume in this bus is astronomical. That might be your dining out budget. Again, we're not going to judge ourselves. That's not helpful. That's frankly not fun. We're just noticing. We're being mindful. And we're kind of an anthropologist in our own life. We're going, oh, that's really interesting. I love dining out, but wow, I'm spending a lot of money on it. And that's money I could be using towards the thing that's stressing me out. Please keep all of this. You're going to need it later. All of the accounts that you wrote down and the balances, all of these goals, these very specific goals that you wrote down and your sticky points, you're going to need all of this information later. All right. Finally, let's talk about some actionable things you can do at the end of this episode to feel a little bit better about your money right now. First, we're going to do what's called a money diary. A money diary is simply reviewing our discretionary purchases for a period of time. I recommend at least two weeks, but really a month. You're writing down everything you spend money on, not only where you spent the money and how much. I went to Starbucks, I bought a $5 mocha, right? But why we made the purchase and how it made us feel. We're not only going to review where our money's going. Raise your hand if you're that person who looks at your bank account and you're like, where the hell did my money go? Yep. Looking at you. We're also going to review if our purchases actually equate to our values. So in our money diary, we're not just going to say, I spent this amount of money at this place. I went to Starbucks and I bought a $5 mocha, but we're also going to say why we made the purchase and how it made us feel. If you've taken anything from our work, you know that money is emotional. Money is psychological and your spending decisions and your financial decisions have much more to do with your emotions and what's going on with your brain and body than like numbers in a spreadsheet. So for at least two weeks, I would really recommend a month. You're going to look at your purchases. Do they align with our values? Do they make us feel good? And you're going to track where the money's actually going. Please do this practice and take it seriously. Don't feel like you have to write out the next great American novel. Your how it made you feel can just be an emoji, but take this money diary, start keeping it, and we'll see you for the next episode because we've got more that we're going to do with it. And questions to think more about that relate to this money diary. And again, if you're a journal or great place to start, what do I like spending my money on? What do I not like spending my money on? And where am I spending money without being fully present in my brain and body? This is what we call impulse or emotional spending. So again, what do I like spending my money on? What feels great for me and my values? What do I like taking my hard earned money that I worked really hard for? And where does it feel worth it to spend money? What does it feel not worth it to spend money on? What does not equate with my values? And finally, where am I spending money without being fully present in my brain and body? Thank you so much for joining me for the first episode of Financial Foundations brought to you by State Farm. We're so excited for this series and so thrilled to have an amazing partner like State Farm to help us bring it to you. I'll see you back here for episode two in two weeks. Thank you so much for being here and we'll talk to you soon. A huge thanks to State Farm for supporting our mission here at her first 100K and making the Financial Foundations series possible. Like a good neighbor, State Farm is there. Neither State Farm nor its agents give tax or legal advice. Thank you for listening to Financial Feminist, a her first 100K podcast. Financial Feminist is hosted by me, Tori Dunlap, produced by Kristen Fields, Marketing and Administration by Carina Patel, Sophia Cohen, Khalil Dumaz, Elizabeth McCumber, Beth Bowen, Amanda LeFeu, Masha Bakhmakeva, Kaylin Sprinkle, Samaya Mullica Rio, and Harvey Carlson. Research by Ariel Johnson, audio engineering by Austin Fields, promotional graphics by Mary Stratton, photography by Sarah Wolf, and theme music by Jonah Cohen sound. A huge thanks to the entire her first 100K team and community for supporting the show. For more information about Financial Feminist, her first 100K, our guests, and episode show notes, visit financialfeministpodcast.com."
    },
    "podcast_summary": "Summary:\nWelcome to Financial Foundations, a mini-series designed to teach financial basics and promote financial feminism. The series, brought to you by State Farm, consists of seven short, actionable episodes that cover topics such as budgeting, debt management, investing, and the concept of being a financial feminist. It also encourages listeners to keep a journal to explore their first memories of money, their family's relationship with money, and their own emotions and beliefs about money. The series aims to help listeners understand and improve their relationship with money, and offers practical tips for building a strong financial foundation, including the importance of creating an emergency fund, paying off high-interest debt, prioritizing retirement savings, and setting specific financial goals. The podcast also introduces the concept of a \"money diary\" to track spending habits and align financial decisions with personal values. This series provides valuable insights and tools for individuals at any stage of their financial journey.",
    "podcast_guest": "State Farm Insurance is a group of mutual insurance companies throughout the United States with corporate headquarters in Bloomington, Illinois. Founded in 1922, it is the largest property, casualty, and auto insurance provider in the United States.",
    "podcast_guest_details": {
        "Guest Name": "Tori Dunlap",
        "Guest Job": null,
        "Guest Fame": null,
        "Guest City": null,
        "Guest Website": null,
        "Guest Media": null
    },
    "podcast_highlights": {
        "highlight_1": "This series is here to help you untangle your finances and get started wherever you are",
        "highlight_2": "The first priority is building an emergency fund",
        "highlight_3": "The second priority is paying off high-interest debt",
        "highlight_4": "The third priority is investing for retirement while paying down lower interest debt"
    },
    "podcast_score": {
        "score": "4",
        "review": "I really enjoyed this podcast episode. The host provided clear and actionable advice on topics like budgeting, paying off debt, and investing. The journaling exercise was a great way to reflect on my own relationship with money. I appreciate how the host emphasized the importance of understanding our emotions and upbringing around money. The financial game plan and money diary were also helpful tools for organizing and evaluating my financial goals and spending habits. Overall, I found this episode informative and empowering. I look forward to listening to more episodes in the series."
    }
}