{"podcast_details": {"podcast_title": "You Can’t Make This Up", "episode_title": "Back to Gilgo Beach: Lost Girls.mp3", "episode_image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/70/19/2d/70192d8c-1486-a692-1c62-6d5b6962b9a2/mza_7520422024347061787.jpeg/400x400bb.jpg", "episode_audio": "https://chrt.fm/track/4G6E1D/traffic.megaphone.fm/NETFLIX3471796299.mp3?updated=1690299967", "episode_transcript": " I'm Rebecca Lavoie, and this is You Can't Make This Up. You Can't Make This Up is the podcast where we uncover the true stories behind your favorite Netflix documentaries and films. On today's episode, we'll revisit our March 2020 discussion of the Netflix film Lost Girls. True crime fans have heard the news. An arrest has been made this month in the Long Island serial killer case. The development has renewed interest in the crimes that baffled authorities for more than a decade. Today, my Crime Raiders On co-host Kevin Flynn talked with director Liz Garbus about her 2020 film Lost Girls. Starring Amy Ryan, the motion picture follows Mary Gilbert as she searches for her missing daughter Shannon. After little interest from police, Mary takes matters into her own hands, driving her own investigation within an insular gated community near Long Island's Outer Banks. Her mother forces detectives and the media to help uncover numerous unsolved murders. Shannon went screaming through here at 4.51 in the morning and no one helped her. Where is the outrage? Where's the concern? Four dead bodies show up in my neighborhood. I'd be shouting from the rooftops to get to the bottom of it. Where are they hiding? The film is Lost Girls. The director is Liz Garbus and she joins us now. Liz, what a great film you put together. Thank you. See, I mean, you're mostly known for your documentaries. So what made you think, okay, now is the time to do a narrative film, something dramatic as opposed to some nonfiction? Well, I had always been kind of open and looking for a narrative scripted project that would inspire me the way that my documentary subjects had inspired me. And when the script of Lost Girls came to me, I thought, okay, this is the one. It's about so many issues that I care about. There's this extraordinary character at the center who's quite complex. It kind of just, it spoke to the various themes and richness of character and complexity of life that I look for in my films. Yeah, tell me a little bit about the script as it comes in because first of all, the source material is Bob Kolker, great author. And then you've got the screenwriter, Michael Weary. Am I saying that right? Yeah, Michael Weary. Yeah. Weary. Yeah. So I think he has done this before or he's taken a nonfiction story and dramatized it. On Netflix, it was the Ted Bundy film, extremely wicked, shockingly evil and vile. He seems to have the sensibility to know how to transfer that into a dramatic scene. Yeah. Well, look, like you said, you referenced the book by Bob Kolker, Lost Girls, which is an extraordinary piece of journalism and a great nonfiction novel in the spirit of In Cold Blood and other great predecessors. And in Bob Kolker's book, there are five women who were sex workers who went missing in the 2000s. So many of them were these kind of cold cases of these girls who went missing, which the authorities didn't seem particularly interested in investigating. What Michael Weary did was he took the story of Shannon Gilbert, who was the last woman in that series, and made her the centerpiece and the way in which we look at the entire mystery of what happened on Gilgo Beach. So Shannon Gilbert was last seen running through this beach community, which seems so different than the other cases, the other crimes, and maybe just because she was spotted. But I feel like it adds a mystery on top of a mystery. Well, as you mentioned, Shannon, some of the facts in her disappearance were different than the other women, or as far as we know, because she went to Oak Beach, she was with a John, a client. But she had been driven there by a driver, which is typically her safety. And at a certain point during this call, everything went bad, and she was screaming and frightened. Why? That is the big question. What scared Shannon Gilbert? So much so that she ran out of the house, she was hiding behind the couch, ran out of the house, and went screaming down the road in this very quiet, very isolated beach community of Oak Beach, which is way out on Ocean Parkway, past Jones Beach in New York City. And she was banging on doors asking for help. Some people ignored her. When there was an older gentleman who offered to help her, and he said he would call the police, that seemed to scare her more, and she ran away. So here was clearly a young woman who was afraid of who might come from the police who might help her, and who was afraid of something that was going on in her call. And that's kind of more information than we have on any of these victims. But we do know that by nearby where this happened, the other young women's skeletons were found. And they were dumped on the side of the road almost without even a care of trying to cover them up, as if the killer just sort of thought no one's going to bother really looking for these ladies. No one's going to listen to their families. There's a great mystery at the center of Shannon's disappearance. There had been lost evidence. There had been negligence, and some would allege a concerted cover-up. And there is a great mystery there. I do believe we will know the answer one day. We have in the end here sort of, again, this open question about the nature of these crimes. First off, do you think that the crime against Shannon Gilbert is separate from the crimes against Maureen and Melissa and Megan and Amber Lynn? As we possibly be looking at two different killers, two different sets of perpetrators, that they're connected by geography but not anything else? Well, they're connected by, I think, more than geography. They're connected by their type. I mean, they were all advertising on Craigslist. They were petite. It seemed that whoever was booking the calls with them had a type. They're connected, like you said, by geography. I mean, where Shannon went missing and ultimately where her body was recovered was extremely close to where the other women were, just a few miles down Ocean Park Way. We know that Shannon went running and was calling the police, so it's not that surprising that her body was found further away. It wasn't such an easy dump for the killer in the way that the other victims were, that he was able to sort of keep them in the same area and just on the side of the road. He had to do something different with Shannon. So I think that there is a lot more that connects them than separates them. Yeah, and one of the frustrating things that you bring up is that the authorities didn't always think they were all connected. Correct. And that was something that really made Mary Gilbert very mad. The idea that somehow Shannon, because she had a driver or because her body was found in a different place, wasn't connected. It was a way of almost minimizing it and blaming Shannon's death on Shannon. My daughter is in on drugs. She didn't run away. She's missing. Now, I have been hung up on, dismissed and ignored, but one thing I won't be is silenced. And you know that, oh, Shannon must have been on drugs and she just got confused and ran into the middle of her marsh with all her clothes off and just died there. Sort of an implausible theory. And this marsh that, you know, that she's found in, the police didn't even want to look in because they thought it was so hard to get into. So how you would think a 24 year old, I don't know, 100 pound, I'm guessing her weight, she was quite slight, would get into the middle of a marsh that police don't even want to cross into just by accident because she's disoriented. It doesn't really make any sense. Right. So the Mary Gilbert character has got to carry the emotional load for this film. So casting it meant that you had to find somebody who had some chops. Tell us about that process. Yes, you know, I got to know her a little bit, you know, while I was making this film before she died. She was a very complex, very smart, very determined woman, tremendous amount of nervous anxiety that propelled her with a really tough life story. And casting that role was key. It is really Mary's film in many ways. And when I first met and sat down with Amy Ryan, I think she is, you know, one of the greatest actresses working in America. I think she's a national treasure. She probably came across my radar in The Wire was when I first started kind of clocking her as an actress. Her work in Gone Baby Gone, which are under an Oscar nomination, was incredible. There's this laugh that she does, which is so guttural and it like, it's not Amy Ryan, it comes from some other other plays. She's just so talented and then, you know, all the kids know her and love her from her role as Holly on The Office. And so, so in any case, you know, Amy was a dream come true and she's so brave. There was no place she wouldn't go. And she's also so supportive of her fellow actors. She's just the best. Was it intimidating directing an Academy Award nominee? Well, Amy is the most down to earth person. And so I would say she brought no attitude. We want to get to work. We shared so much research together, looked at documentaries in which Mary had appeared, looked at other inspirational groups of women, like mothers of the movement, mothers who had lost their children to gun violence and the kind of impact that those women had coming together after their losses, which spoke a lot to what Mary's character went through. So it wasn't intimidating because Amy is not intimidating, but you know, yeah, I should have been intimidated by her because she's such a baller. But in fact, she was just she's just a hard worker, no nonsense, incredible actor. Yeah, she gives a great performance and you should obviously take some of the credit for for getting her there. So as far as you know, who did you meet among the families and did like those experiences really inform the way we see them on the screen? Quirks or personality traits or or whatever else? Yeah, I did get to spend some time with Mary Gellar before she passed. And that was so useful. First of all, we kind of hit it off and chatted and I got to get a sense of her energy and mannerisms. She also told me a couple of things that I kept dear. One thing she said to me was, you know, I don't care if you have me smoking in the movie, I do smoke, but I know I would never smoked when I went to a press conference. And it was such a telling instruction from her because it was sort of like, yeah, I know how people perceive me. They perceive people who smoke as working class and they're not going to take me seriously. Therefore, I understand the codes, the game that I need to play in order to have my voice taken seriously. Like the way she would dress intentionally to be taken seriously with the authority. Exactly. That in some sense that she understood the prejudices against her. She understood that the reason that people weren't looking was because they wrote them off as, you know, sort of citizens that didn't matter. And she needed to combat that using the codes that they understood. And it was just little details like that in meeting her that enabled me to have some details in the script, like the suit you mentioned or like smoking only behind closed doors. That felt very true to who she was and the way she was approaching this battle. How did you hear about how she died? That was the craziest thing. I was actually, it was a summer of 2016 and I was just having dinner with friends. We were actually outside on a picnic table and a text came up from Bob saying he had heard that Mary had been killed. And it was just the craziest thing because, you know, she was the one searching for justice, searching for the killer. So of course my first thought is like, could the same person who killed Shannon and the other women have come and killed Mary? How brazen. That would have been strange. But then to hear that actually it was Mary's own daughter who had been suffering, who has been killed, was more tragic. Mental illness had plagued Mary's family. It led to some of the divides in her raising of Shannon where she had to basically send Shannon away. She couldn't raise her herself because she couldn't get the mental health care she needed. And then to be killed by your surviving daughter who was, you know, Mary was helping, who Mary was taking care of, who she was checking in on her to try to see if she was taking her meds every day. It was the cruelest irony that once Mary was able to take care of someone and get her the help that she needed, that that ended up ending her own life. Did it change the way you signpost the family dynamic in the film? Sure. Well, I think that, you know, Sarah Gilbert, who is now in prison for killing her mother, you know, she was not displaying symptoms of schizophrenia at the time that, you know, that Mary was searching for Shannon and that Cherie was searching for Shannon. You know, as you may know, schizophrenia is sort of a later onset disease. But in talking to some psychologists and doing some research, you know, we explored some of the kind of precursors that might have been occurring at that age, although, you know, she really wasn't displaying symptoms, but it was important to kind of, you know, get a sense of this character, that there was something else on Mary's plate that she was she was needing to deal with. Talk to me about Gabriel Byrne, his character. I'm trying to wonder out whether we're supposed to like him or not. Well, I think that's a good question. You know, the truth about this case is that Richard Dormer, who is played by Gabriel Byrne, he oversaw this case. Dormer was a immigrant from Ireland. He made his way up the ranks and was promoted to be commissioner of police in Suffolk County and, you know, had gone to Harvard. You know, he was kind of living the immigrant's dream. And then during his tenure at Suffolk County, there were many, many scandals. Suffolk County has a history, as many New Yorkers know, of being a sort of corruption ridden department. And so Dormer's, you know, his reputation was quite tarnished. And I think he was a man who had very big dreams and goals that were ultimately kind of brought down by the realities of policing in Suffolk County. So I think that by the time this case finds him and by the time we find him, and this is something that, you know, Gabriel and I talked a lot about when thinking about his character is he's a man who has good instincts, has empathy, wants to do the right thing, but is so on his way out. The power had shifted. He was a lame duck that he, you know, sort of putting going through the motions felt like enough at first until he really became moved, I think, by the outpouring of the, you know, the women's energy to really start looking into this case. His tenure was, you know, ended soon after. And as you know, we haven't caught the killer. So like him or hate him, you know, I think that the police work on this case was ineffective. Perhaps Dormer wanted it to be better, but he didn't get the guy. So my takeaway is that when his Irish accent slipped in, there wasn't an accent. That was right. That was that was not something we had to work too hard on. This is good with this. There's a lot we don't know at the moment, which is why it's really important that you don't talk to the media. Let us handle that one wrong word and they'll make a meal out of it. It's in your best interest. You shot all over Long Island. It looks like. Do you think that that contributes to the look of the film? I hope so. I mean, yeah, we definitely wanted it to be that authentic Long Island brush and thorny nettles. And I don't know if I had talked to you a year ago, I would have remembered the name of all the the greenery that was very specific to the area. But now, you know, now it escapes me. But you see it and you feel it in the movie. And you know, it's not the Hamptons. I mean, I think when sometimes people think about a beach community in Long Island, they think, oh, you know, this is the Hamptons. It's not. These are middle class retiree communities, a lot of retired firefighters, construction workers. These are not lavish homes. As a documentarian in your bones, how did it feel to take dramatic liberties for the first time? Yeah, it was interesting. It was kind of like thinking about other inspired by true stories films that I've loved and sort of studying them and feeling like what is the latitude here? I mean, I think that what's important and it's the same in docs is to find the core truth and the core themes that you believe need to be communicated. And of course, we have do not have all the information of what went on behind closed doors in these families as they struggled with this loss and on this journey. But I think from the available reporting, the incredible reporting that Bob Kolker had done, we had a sense of the worlds and of the conflicts and of the issues that these families were facing. And we were able to build a meaningful, you know, a truthful world. We did have the opportunity to show the families the film just recently. And while, of course, they acknowledge, oh, that didn't happen exactly on that same day or I didn't hear anything about us kind of getting the core of their journeys wrong. So I felt like we were able to find that balance. How did you balance or the idea of you need to give the audience some of who the suspects are without really pointing a finger? First of all, did your documentarian sense kind of come in as far as here's the line where it's still informative, but it's not too far? Do you think you were like singularly prepared because of your background for that? Well, that was definitely one of the great challenges in the film was we don't know for sure who did it. We know some of the things that went wrong in terms of investigating who did it. We know that Mary Gilbert had some very strong ideas about who was behind it. The goal was to suggest all of those things, to see the things that went wrong, to get into Mary's point of view about who she felt could have been a suspect, but also giving that suspect the deniability that they deserve. So it was a very fine balance to strike. And it was one of the great challenges of making the film. You have like a group of characters, like a team. When you write them in fiction, everybody's got to be different, right? And so the family of the victims all come together. I'm thinking of that scene in the restaurant where they're all sort of meeting for the first time. Was there enough differences between them in real life that you didn't have to like do too much or did you have to dramatically amplify it so everybody seems to be their own person? You know, a lot of those women had been interviewed for TV, so we were able to really look at them, listen to them, listen to their accents, listen to their, you know, are they people who cry when they talk about their loved ones or are they people who get angry or stony? You know, we were able to study them. And so they were all quite different. And the wonderful actresses who played them, I think, embraced those differences and made them unique and interesting characters. It was such a wonderful ensemble of women actors. What was your favorite scene? I think, well, they're all my babies. But I do love the scene at night in the hotel room where all the women come together and they're making signs preparing for their vigil. And an argument breaks out between Kim, who's played by Lola Kirk, and Mary Gilbert, who's played by Amy Ryan, about Shannon's status. You know, Mary went for a long time believing that, you know, they would still find Shannon. And in this scene, Mary's confronted with some hard truths. She's probably forced to get stoned, drunk, high. Not forced. Okay, whatever. I'm just saying I've lived it. Well, I'm just saying you're not Shannon. Mary, I feel for you. Or then I feel for myself or any of the other ladies here because Shannon's still missing. And no one's better than not knowing. And I thought the dynamic between these two actors was fantastic. And I was very happy with the production design of the motel room and the kind of we had the whole cast of women in there together. I enjoyed that editing that scene and shooting it. And with Anna Reader and Lola Kirk and Miriam Shore, I mean, we just had a whole bunch of terrific female actors. And of course, Thomas and Mackenzie and Una Lawrence, who are the play Mary's daughters, is just such a great cast. Part of this story is we don't have really a satisfying ending. We don't know who the killer is, though we're left with a lot of great suspects. It can be difficult for an audience sometimes to walk away not knowing. How do you present a film in a way that is truthful to that reality, but is still satisfying to the audience? Well, look, I mean, real life is not filled with satisfying endings. And to the extent that movies reflect real life, this one certainly does. And we tell our viewers up front, this is an unsolved case, you know, and so you're walking in knowing that that's the case. And hopefully viewers will enjoy after seeing the film, you know, getting online, seeing what they can learn. You know, there's a lot of information out there. Ultimately, the film is a drama about a mother and a missing daughter and her surviving daughters. That's the heart of this film. So I think that the narrative arc hangs itself on that family drama, as opposed to the whodunit. Is there a social justice message in this film? There's definitely a social justice message. I mean, you see that, you know, through Mary's struggle and all the other families had the same thing, the dismissiveness of the authorities when a young woman who happened to make a living as a sex worker went missing. That is, you know, sort of a misogynist and classist approach to policing. You know, every body, every missing person should have the same value. And we clearly see that that was not the case in this instance, that these were people who were devalued, their losses, their families didn't have a voice. And at the end of the day, it's about believing women. I mean, these women were right. Their daughters didn't just go off on benders. These women were murdered. And how if the police had taken the early disappearances more seriously, we would have had lives saved. So I definitely think there's a social justice message there. Well, this was a glorious film. It's called Lost Girls and the director is Liz Garbus. Liz, thank you so much for this inside look at your film. Thank you for having me. That's it for this week's episode. Thanks again to Kevin Flynn and Liz Garbus. For more of my takes, check out my other podcast, Crime Writers On. Each week on that show, we break down the latest in true crime documentaries, films, podcasts and pop culture. If you like, you can make this up. Please rate and review this show and share it with your friends. You can find us on Apple Podcasts, Spotify or wherever else you get your podcasts. And make sure to follow the show to stay tuned for all new episodes. Our music is by Kelly Mack and Netflix Music Lab. You can make this up as a production of Netflix. I'm Rebecca Lavoie. Thanks so much for listening."}, "podcast_summary": "In this episode of the podcast \"You Can't Make This Up,\" director Liz Garbus discusses her film \"Lost Girls,\" which is based on the true story of Mary Gilbert's search for her missing daughter Shannon. The film sheds light on the Long Island serial killer case, which recently saw an arrest, renewing interest in the unsolved murders. Garbus explains her decision to make a narrative film instead of a documentary and the importance of the story's themes and characters. She also discusses the challenges of balancing truth and fiction in a real-life case where the killer remains unknown. The film highlights the dismissive attitude of authorities towards missing sex workers and carries a social justice message about the valuing of all lives. Despite the lack of a satisfying ending, the film focuses on the emotional journey of the characters and the fight for justice.", "podcast_guest": "Elizabeth Freya Garbus (born April 11, 1970) is an American documentary film director and producer. Notable documentaries Garbus has made are The Farm: Angola, USA, Ghosts of Abu Ghraib, Bobby Fischer Against the World, Love, Marilyn, What Happened, Miss Simone?, and Becoming Cousteau. She is co-founder and co-director of the New York City-based documentary film production company Story Syndicate.\n\n", "podcast_guest_details": {"Guest Name": "Liz Garbus", "Guest Job": "Director", "Guest Fame": "Lost Girls", "Guest City": "Long Island", "Guest Website": null, "Guest Media": null}, "podcast_highlights": {"highlight_1": "Lost Girls is a true crime film that follows the story of Mary Gilbert as she searches for her missing daughter.", "highlight_2": "The film addresses issues such as the dismissiveness of authorities towards missing sex workers and the importance of believing women.", "highlight_3": "The director, Liz Garbus, was inspired to make a narrative film that had the same impact as her documentaries.", "highlight_4": "The film explores the mystery of what happened to Shannon Gilbert and the connection between her disappearance and the other unsolved murders."}, "podcast_score": {"score": "4", "review": "This podcast episode focuses on the film Lost Girls, which explores the real-life case of the Long Island serial killer. The director, Liz Garbus, discusses the making of the film and the challenges of portraying a true crime story. I found the conversation to be insightful and engaging. The podcast score is 4 out of 5."}}