{"podcast_details": {"podcast_title": "Money Rehab with Nicole Lapin", "episode_title": "How To Get a Job on Wall Street.mp3", "episode_image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/3b/4a/c7/3b4ac778-34eb-4135-3500-6d9afe56ae5f/mza_15251289027025739137.jpg/400x400bb.jpg", "episode_audio": "https://chrt.fm/track/GB95B3/traffic.megaphone.fm/MMNNT8344338034.mp3?updated=1689227073", "episode_transcript": " I'm Nicole Lapin, the only financial expert you don't need a dictionary to understand. It's time for some money rehab. If your money journey has turned into an obsession, I get it. That's what happened to me. And maybe like me, you're thinking, I want to take this whole moneymaking thing from an extracurricular activity to my full time jam and actually get a job on Wall Street or Wall Street adjacent. For anyone who's considering that career for themselves, maybe it's you or your mini you, a friend, a mentee, a family member, I've got something to help get you started. If you think back to March, March, 2023, not 2020, thankfully, my company Money News Network launched the podcast Trade Like Einstein hosted by Peter Tuchman, aka the Einstein of Wall Street. Recently, he did an episode on this exact topic featuring an interview with the newest intern at his group. She is awesome. And when it comes to how she got this internship, honestly, I've got no notes. And when you're done listening, check out the link in the show notes to subscribe to Trade Like Einstein and never miss an episode. And now here's Einstein. Three, two, one. Hey, everybody. It's me, the Einstein of Wall Street. We are here with Trade Like Einstein. I am Peter Tuchman and we're here on the floor of the New York Stock Exchange in the balcony. History is made in this building every single day. Somebody with my long term experience up in here for 137 years, it is my responsibility to help teach you how to navigate this market successfully. Boom. We are so excited today to have something super, super special. We have our young friend here, Alicia Ishvak. She is a student at Baruch College and it's super important for us to really understand what's going on here. You know I like to break down that I've found something I really love to do. We talk about education, motivation, inspiration and whatnot. So I was fortunate enough to meet this young lady through, she actually came to me and tried to come and meet me here at the New York Stock Exchange. And she represents a group of young finance students at Baruch College here in New York City. And we were able to sort of connect. And that was sort of important because you know everybody tries to get to me. They want to come down here to the Stock Exchange. And very often people are very anxious or don't feel they're worthwhile to get in touch with me to try and get their message across. What I loved about her connecting with me was she knocked on the door. I opened the door and we had this immediate connection because I could feel she really loves what she does. And she wanted to, she was on a road to success. And that's what we're going to call this episode, Road to Success, the exception to the rule with Alisha Ishvak. So I want to introduce her. How are you? I'm doing very well. Fantastic. Thank you so much for having me here. And actually, just to add on, it took you two months to get back to me. So I was just like cold emailing, trying to get a tour of the New York Stock Exchange because we're one of the largest clubs at Baruch. It's called the Finance and Economic Society. And so all of us, it's a dream to be here. So just consistently, I think just reaching out and yeah, one day after two months we replied and that's kind of how we hit it off. Persistence is one of the greatest qualities that I respect in a human being. OK, so what ended up happening? She came down to the stock exchange after two months of knocking on my door. You know what? If you keep knocking on my door, I promise you I will eventually answer it. OK, so we came down to the floor. We met, we had a tour with this young investment group from Baruch College and we had an amazing time and then our relationship sort of grew. I ended up doing a forum there with their investment club and that sort of has opened up bigger doors. She's now an intern with us at TradeMos working with my son, Benjamin Tuchman, on an amazing trading model that we do on the floor. What is so different about this young lady, in my opinion, is look, it's been a while since I've had my hand on the pulse of what it's like. Look, we always joke about it. I went to high school with Alexander Hamilton. That was 137 years ago. So it's been a while since I had my pulse on what it's like to be a young student, an aspiring high school student, a college student, someone looking for interns, trying to find that road to success. Perseverance being one of the greatest qualities of that. So I thought it would be interesting. We talk about trading the market, charting, education, motivation, inspiration, all the things that really make up me and my love here and my love for what I do, the adrenaline and everything I do. But I think we're going to break this thing down for Money News Network, for this new show, Trade Like Einstein, and really break down her journey. Her journey as she came here as an immigrant, she has grown and become an incredible young lady and a student and really is on the road to success. And look, she's not the rule. She is the exception to the rule because she's checked off every box along the way. And we know it's an incredible challenge. I know it. I have two young children. It's like, actually, even though I don't have my finger on the pulse, I know what it's like to be a young student, somebody aspiring to be really great and find success and something you love to do. But I thought it was super important in this age. We're in 2023. The world is different now. We've got computers, we've got social media, we've got a world that just came out of a pandemic. So what is it like for a young student trying to find success, trying to find something they love to do? And we're going to frame it within the world of finance because that's what I do. And that's the direction she's going to do. So we're going to ask her to tell her story and get on with it. Let's go. Awesome. Yeah. Just to give you some background, I immigrated here with my family when I was about 80 years old and ever since I've been living here in Brooklyn. Yes, I kind of grew up here, went to middle school, high school, and then college. And like certainly like Peter, you've said, it's pretty hard and stressful trying to navigate college, trying to land an internship. I think it takes a lot of perseverance, commitment, dedication, and certainly I hope just following those values. I've landed a full-time job at Citi. I landed an internship during my junior year at TD Securities. I was in the investment banking division and then currently I'm interning at Commerce Bank as a corporate banking intern along with trade moss here at the New Stock Exchange. Trade moss here on the NYSE. Yes. I am also interning here with Benny Tuckman. And yeah, so that's kind of what I've been up to recently. But yeah, it's certainly been a lot navigating and trying to land your junior summer internship and then also landing something full-time that I would love to pursue as my career and ultimately job. And yeah, so in college, I was going around to different tours of different colleges across New York City and Baruch was one of my best options. I went to Baruch. Go. Amazing school. I can't say enough great things about it. But yeah, so I ended up at Baruch. And freshman year, I was attending a lot of like we had career fairs. So we would have like recruiters from different companies come in and speak to students. So I was attending a lot of those trying to like get an idea of, hey, like what is banking? What is investment banking? Because when you walk in, when you come in as a freshman, investment banking, I feel like it's very glamorized. And so everybody's like, yeah, I wanted to do investment banking. A little do people know what it actually takes. And so I think just realizing that trying to speak to people and ask them important questions like what does your day to day look like? What skills do I need to have? Right. So try to match that with what your values are, what you essentially want to do. So I think a lot of networking was the key in like landing these internships, especially my junior internship. I actually didn't even do an application for that. It was straight through networking. So I was part of FES and we have a lot of connections, alumni. What's FES? Finance and Economic Society. So it's like the largest finance club I believe. And that's who came to tour here. So I can join as many clubs as you can. We'll also be back on Wednesday for our second tour. Tour number two. It's a semester thing. Yeah. So, you know, I was just networking a lot and reached out to somebody that was recruiting, doing a resume job at TV Securities. And yeah, he was like, we love your resume. I'd love to like have, you know, a first round of interview. I was like, yeah, let's do it. So it was like the very next day they called me. I did a phone call interview. And before I actually even got to send a thank you letter, they're like, hey, we'd love to do a super day. So like I didn't even have time to send a thank you letter or like prep. But the next morning I had super days with the two MDs from TD. And you know, it was a great casual conversation. Really enjoyed it. And yeah, before I even got to send them thank you letters, they're like, hey, we'd love to extend the offer. So it all happened very quickly. And yeah, that's kind of how I landed my junior summer internship. Let me interrupt you for a second. But let's because let's talk about the qualities that it takes to be able to do what you're doing. Everybody out there has so many interests. We are barraged by all of the wonderful things, all these companies that we talk about here on the floor. I always talk about this is the greater greatest consumer generation in the world. And so we we are involved in it. We're very loyal consumers. We know the different companies are out there. And everybody knows a lot about finance. We just came out of a time, you know, from COVID, where I always talk about the democratization of the trading community. You as a young person going to college was suddenly your life was interrupted by COVID. Right. You had sheltered in place and quarantined at home, you know, sitting there with a stimulus check or whatnot, or just trying to figure out how do I navigate this? This is new. There's no there's no playbook for what do I do in my life is completely interrupted. I don't have to go. I don't have classes to go to. I'm at home and I'm like at that point in my life where I'm trying to figure out what to do. How did you navigate your way through that? Keep your focus. And one second thing is, did you always have that confidence or see? It's funny for me. You know, I have a mentor whose name is David Meltzer. And David Meltzer is one of the great life coaches to many billionaires around the world. He's a gentleman that the movie Jerry Maguire was made about. He was a gentleman who has seen great success. He's seen great failure and he's gotten back on his feet. And he's a big motivator and inspiration to me. But he always talks about that. You know, that feeling when we wake up in the morning, we're about to embark on something new and we have to make that phone call or we have to make that call to TD to see if they'll see me or we have to go and see that professor or we have to network in these environments. We get nervous. We get anxious. We don't feel we are good enough or our self-esteem is in question. And he always talks about those butterflies that we get in our stomach and that when we're about to do something. And he always said to me, because I would say to him, I said, I've been around for a long time and still when I embark on a new thing, I still get nervous. I'm still anxious about it. And I kind of feel like, where does that come from? Is it a lack of confidence or whatnot? He flips that old narrative on his head and says, no, when you're about to embark on something new and you've got those butterflies in your stomach, that is actually you about to embark on something that is really significant as opposed to looking at it as a negative. It's a means you're about to change some stuff off. So where did that confidence come for with you? Because it doesn't a lot of children, a lot of people who come to me, right, you knocked on the door a number of times, but persisted. A lot of people try and reach me and maybe not and never call back. Some people try things, they get knocked down. The first door they go to is not opened automatically and they kind of give up and they may have actually lost an opportunity along the way. So where would that confidence come from? Tell me. You know, I think it's something that I developed over time, certainly. In high school, I remember like I would just pick up a lot of self-help books such as Rich Dad, Poor Dad, the Classic, Thinking Bro Rich, a lot of psychology books of this kind. And just like watching a lot of YouTube videos on, you know, like what it takes, you know, the mindset that you should have, like John Colvillian is a great author. I kind of follow him as well. So yeah, just like having that mindset to put your emotions aside, get up and do what you have to do. Just get after it. I think that was my motto. And reaching out to him in terms of being persistent. I know like a lot of students tend to get discouraged after like, you know, like I mentioned, you replied back to me after two months and that was just like me being consistently like reaching out on LinkedIn. Yeah, like I certainly did have that thought that, yeah, he's probably like bombarded with so many messages from other students like me. So I didn't really expect him to get back, but there's also there's always a chance. Like I don't give up. So I think with everything else, I've always been persistent regardless of what the circumstances are, how I feel. I put all that aside. I know what the goal is. I just go after it. And I think to have this mindset, you definitely have to have a lot of self-discipline. And like I mentioned, I think in high school, reading a lot of these self-help books really helped me like build and grow that mindset over time. So it's, you know, it's interesting because study habits are super. So there are a lot of things that are important because along the way, I did so many, if you ever hear me tell my story about studying, getting a degree in agriculture, international business, owning a record store, trading commodities, moving to Africa for two years, coming back here, finding my job on the stock exchange. My journey into finance was not a direct one. And so it's a matter of what are the qualities that make us able to find our goals and achieve our goals, find success, find fulfillment and whatnot. We may not always have a direct line to what we end up doing and mine was not, but persistence, discipline, consistency, honesty are super important things. And also the things, as you said, trying to do everything in your power to build confidence, also not feel that you can't knock on every door. It's not a matter of how many times you get knocked down. It's how many times you get back up and not miss that next opportunity. And also along the way to learn the study habits too, so that when you find something you love to do, right, you'll never work a day in your life. You're going to have all of those components to be great at whatever you want to do. So for me, I know that in my world that I've done, look, I've had a really, I've had good times and bad times. I've had a lot of success in my life. There's success, which is kind of short-term financial success. And then there's fulfillment where you really, you really have that feeling that, that it's a gift that you're able to connect people to opportunity and actually do good things. But one of the reasons I sort of had this epiphany when I was talking, we were talking about what's the next, what was going to be our next segment here in Money News Network, Trade Like Einstein, was because I get this question asked all the time and I know that I can motivate, I can frigging motivate a dead person. I can connect you with people along the way on the industry. But there's a far journey between where you are as a young high school student or a college student and those four years that transpire because I know I have people who contact me all the time and all they'll just say is, can I have an internship? Can I have an internship? I'm wondering if there's a better way that we can get people to understand how do you do that? How do you, do you read up on the person? Now we've talked about it too. When I introduce people to somebody that may be able to better them along the way and I'll just say, you know, start to learn, start to meet people, right? There is absolute, the key to this thing is building a resume, not a resume that you have with all your achievements on a piece of paper because as we know from some guy who's running for Congress that you can make that stuff up any day of the week. But it's a matter of along the way is making relationship. Relationships are kind of key for me, right? I'm one of these, I'm a humanist, right? And so along the way we have a really nice relationship. It went from her knocking on my door, me giving them a tour. And I went and spoke at the forum she talked about, which was a real give back situation. It was me and three or four people who were Baruch Alam, who had been through the ropes, who had gone through that journey, who had found success and they were still in it. They were in their second and third year of their jobs at Morgan, at JP, at Citi, wherever they may be. And they came back to give people that help. I don't need to die with the most toys. That does absolutely nothing for me. But along the way, what's so powerful, and I learned this from my dad is that it's not a matter of really dying with the most toys. It's a matter of along the way, if you can better someone else's life and uplift other people and create this team atmosphere where we can actually be successful and find fulfillment together. That's awesome. My son Benny has obviously felt that and learned that for me. We have a team of five interns. Alicia is one of them. And we're here trying to teach them what we know, whatever it may be, she may not actually end up in finance. It seems to be somewhere where she's headed. But at the end of the day, the things that we learn along the way about relationships, about honesty, about networking, about opportunity, about connecting with another person, those are the things that people who already have done this thing, it's like surrounding yourself with people who are empowering you and not people who envy you and stuff like that. Exactly. Yeah, no, it's very, very essential to have a circle that's supportive and they're ambitious and have goals of their own. But yeah, I think it's also important to emphasize that it's a lot easier said than done. I just mentioned I networked and I got these internships. It didn't happen just like that. It wasn't like that. So certainly, ever since freshman year, I've been building up to that level, right? Making sure that I'm part of activities on campus, financial events that happen, going on coffee chats, cold emailing people on LinkedIn, just trying to learn as much as I can from books. YouTube is one of the biggest resources I've used, especially because I'm a visual learner. So just watching a lot of these videos, reading books, also doing well in my academics. I think all of that certainly adds up and contributes and helped me land those internships. So the key is this doesn't happen by accident. We always joke about it, technical analysis. Making a lot of money doesn't happen by accident. It happens because you average into a bad trade. Same thing here. So you need to wake up every morning and grind. You need to walk the walk and talk the talk. You need to do the work. We talk about it also in our academy that you'll get out of it what you put into it. It doesn't happen by accident. You can't sit there in your bed, having been out all night doing whatever you may be doing and think that the opportunities are going to come knocking on the door. So I think you've done a lot of work. It's really clear that way. And the persistence and confidence is one thing. And it's important, as I said before, that you know what? You may not wake up every day with that confidence, but at the end of the day, if you're not going forward, you're going backward. And that momentum and forward motion, no matter what, do something every day. I know it for me too, because look, life is challenging and it's not going to be a straight path. And I'm sure for you, there were points, whether it's financially, spiritually, emotionally, or whatever way it is, along the way you had bumps in the road, there were headwinds and whatnot. But if you're looking, if you keep your eyes on the prize, and look, whether it's even one day that you just don't have it and your get up and go has got up and left, and then you reach out to someone else, asking for help. It's another thing I learned from David Meltzer. We kind of feel that we're maybe less than and we're not good enough if our confidence that it's at highest peak. But at the end of the day, you can go out there and ask for help. You can knock on any door. What is the worst thing that's going to happen is someone's going to say, no, did you have doors you knocked on that people said, I'm sorry, it didn't happen? Yes, so many. I've even got rejected for applications that have applied to sophomore, freshman, junior year. So it's just being persistent, not getting discouraged, keeping your eye on the prize and every day waking up with a goal. It's also important to have short-term and long-term goals. What are you doing on a daily basis? What is it that you have to achieve? So I think also just being organized, like I have two, three planners. I have Google Calendar, a physical planner. So it takes a lot of hard work and there's days you're not going to feel like getting up, but it's important to have your goal in mind and just putting your emotions aside. And it's OK. We all have bad days. And it's important to also get help and have people. I call it the board of directors, your board of directors, people that you can reach out to and know that they're going to be there on your side. You know what? Look, I've been around for a long time. I have my board of directors. I'm going to call them that going forward. That's great. People who I need help with for my emotional stuff, my spiritual stuff, my financial stuff. And also those days that you wake up and just things are not the planets are not aligning. Life is really challenging. And obviously, and one of the reasons I do what I do is because I've got a sense when COVID came around, I went through a lot of real challenges. I got really sick. I almost died from COVID. And I kind of realized that I needed something. I needed something to motivate me spiritually, emotionally, whatever way to get through this challenges. I literally was hours away from death during COVID. And then I thought of it and I have two young kids and I sort of realized, too, that life throws lots of different challenges. And what it must be like, look, along the way I had an incredibly privileged background, but I also come from a family that had challenges along the way. My parents are Holocaust survivors. They did not have things as easy along the way. They spent four years in prison. Their whole family was decimated. Yet, and this is something that I learned and has taken me so much farther is that they I would ask my mother, how did she survive four years in a camp with thousands and millions of people around her dying every day? And she said, one day at a time, I believe it could get better on the other side of this craziness. And it's same thing that happened with me when COVID came along. It doesn't matter where you come from or who you are at the end of the day. We've seen stories of people, you know, amazing success stories, right? People who came from nothing and have actually built themselves an incredible life full of fulfillment. You don't have to come from something to become something special. Because that spirit, the resiliency of people who are not handed things. Oh, and I watched Chris Rock video the other night and he was talking about people being spoiled and people learning lessons and what it is like to come from nothing and actually suddenly have something and what it takes in the resiliency and the forward lookingness to do this. I do what I do on a daily basis because I've sort of gotten this sense. This isn't easy. Life itself isn't easy, finding something you love to do isn't easy, finding relationships, going to school, finding internships, all these things along the way. And my fear is that somebody along the way, you're going to get knocked off the beam. And I would imagine a majority of people who get knocked off the beam don't get back up or don't. They will have missed an opportunity that could have been not only great for them, but great for us because we will have missed the opportunity who have met them along this journey. That's for me. I come in here every day, whatever is going on, right? Because I don't want to ever miss an opportunity of connecting people to opportunity to help her out or Donnie out or what we're doing here with Nicole and Money News Network. We are trying to network and open up doors and break ceilings and put, create opportunities for people to look. I've met so many people in my life. I've had doors closed on me. I've opened other doors for other people. That feeling is exceptional. So I think we're going to, we'll wrap this up. I think we're going to do more of these, but at the end of the day, we must acknowledge this isn't an easy road. It doesn't happen by accident. This young lady has done an incredible job and we're going to sort of even break it down more for you because I know I get the question asked more times than you can imagine. How do I go about this? What do I do if I'm in high school and I don't know what I want to do? Is that a bad thing? If I didn't get into my favorite college, am I going to be a loser? If I'm in college and I'm not sure of my direction, what do I do? Am I afraid to knock on that door? That guy's not going to answer me. Who am I? And all that kind of stuff along the way. What are the study tools I need to learn? How do I actually do this? The step by step, walk the walk, talk the talk breakdown. So Alicia, thank you so much for what we've done so far. I think we have a lot more to talk about to break it down, but it's clear this is an amazing opportunity to share what I know, connect you with Alicia, who obviously has done it. She's hitting on every piston. She's checked off all the boxes along the way. And we're hoping if I have anything to do with it, I will support her and raise her up to become her best self and be an amazing person that she is. So we're really happy she's here with us on Money News Network. We're thrilled to be here with Einstein. Trade Like Einstein. And thank you for the day. Boom! That's all I got to say about that. Trade Like Einstein is a production of Money News Network. Trade Like Einstein is hosted by the ever energetic Peter Tuckman. Trade Like Einstein is executive produced by Morgan Lavoie. Thanks so much for listening. Check out MoneyNewsNetwork.com for more podcasts."}, "podcast_summary": "In this episode of Trade Like Einstein, hosted by Peter Tuchman, he interviews Alicia Ishvak, a student at Baruch College who has successfully landed multiple internships and is on the road to success in the finance industry. Alicia shares her journey, highlighting the importance of perseverance, commitment, dedication, and networking. She emphasizes the need to put emotions aside and stay focused on goals, while also building confidence through self-help books, YouTube videos, and surrounding oneself with a supportive circle. Peter discusses the qualities and study habits required for success, stating that it doesn't happen by accident, but through hard work and consistent effort. He also draws from his own experiences and family history to emphasize the importance of resilience and facing challenges head-on. Peter and Alicia agree that success is not easy, but with the right mindset, determination, and a strong support system, one can achieve their goals. The podcast aims to provide guidance and motivation for individuals navigating their own career paths and pursuing success in the finance industry.", "podcast_guest": "Alicia Ishvak", "podcast_guest_details": {"Guest Name": "Alicia Ishvak", "Guest Job": null, "Guest Fame": null, "Guest City": null, "Guest Website": null, "Guest Media": null}, "podcast_highlights": {"highlight_1": "Persistence is one of the greatest qualities that I respect in a human being.", "highlight_2": "It's not a matter of how many times you get knocked down, it's how many times you get back up and not miss that next opportunity.", "highlight_3": "Along the way, you had bumps in the road, there were headwinds and whatnot. But if you're looking, if you keep your eyes on the prize, and look, whether it's even one day that you just don't have it and your get up and go has got up and left, and then you reach out to someone else, asking for help.", "highlight_4": "Life itself isn't easy, finding something you love to do isn't easy, finding relationships, going to school, finding internships, all these things along the way."}, "podcast_score": {"score": "4", "review": "I enjoyed this podcast episode of Trade Like Einstein featuring Alicia Ishvak. It was inspiring to hear her journey and how she overcame challenges to land internships and a full-time job in finance. Peter Tuchman's enthusiasm and motivation were contagious, and I appreciated his emphasis on the importance of perseverance and building relationships. The discussion provided valuable insights for students and young professionals looking to navigate their way in the finance industry."}}