{
    "podcast_details": {
        "podcast_title": "The Mike Wagner Show on The B Channel!",
        "episode_title": "NYC photographer-documentary filmmaker Nelson Gomez is my very special guest!.mp3",
        "episode_image": "https://s3.castbox.fm/56/5d/cf/cf82162f4b67728d2285e452cc951ab8f8_scaled_v1_400.jpg",
        "episode_audio": "https://anchor.fm/s/65873ca4/podcast/play/38533305/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2021-7-9%2F86a452e6-763a-c695-1a23-7e23f045af13.mp3",
        "episode_transcript": " The Mike Wagner Show is powered by Sonic Web Studios. If you're looking to start or upgrade your online presence, visit www.sonicwebstudios.com for all of your online needs. Sonic Web Studios specializes in custom web design, app development, social networking, search engine optimization, domain registration, email marketing, online stores, and more. Since our birth, we have been designing and developing immaculate websites and providing web solutions which are a cut above the rest. As a leading web designing enterprise, we have a team of extremely talented web designers who are well-focused and have the experience of working on multiple web developing platforms such as PHP, Magento, custom WordPress, and more. Sonic Web Studios has been helping businesses of all kinds, whether big, small, established, or startup, impress their audiences with exemplary web solutions. We don't just create beautiful and functional websites. We give you a complete online solution with the main goal of enhancing your yearly revenues. We aim to give your business the online exposure and brand acknowledgement that will help you in achieving increased conversions leading to profitable sales. Call 1-800-303-3960 or visit us online at www.sonicwebstudios.com to get started today. Mention The Mike Wagner Show and get 20% off your project. Sonic Web Studios, take your image to the next level. Hey, everybody. It's Mike from The Mike Wagner Show. It's time to give a shout out to our official sponsor of The Mike Wagner Show, international award-winning author Mian Mosen Zia. If you love fast-paced mysteries, then you'll love Missing by Mian Mosen Zia, available on Amazon and paperback in ebook. Missing is fast-paced and intriguing with an unforgettable twist. It takes place in four countries with two strangers and one target where truth is an illusion and those you love will be the first to go missing. It's available on paperback and ebook on Amazon. Missing by Mian Mosen Zia has garnered great reviews and is even loved by Hollywood celebrities including Joanna Cassidy, Forbes Reilly and many others. So grab your copy today. Order Missing by Mian Mosen Zia, now available at Amazon. It's now time for The Mike Wagner Show powered by Sonic Web Studios. Visit online at www.sonicwebstudios.com for all your needs. The Mike Wagner Show can be heard on Spreaker, Spotify, iHeartRadio, YouTube, iTunes, Anchor FM, Radio Public and the Mike Wagner Show.com. Mike brings you great guests and interesting people from all across the globe. So sit back, relax and enjoy another great episode of The Mike Wagner Show. Here by it's Mike from The Mike Wagner Show powered by Sonic Web Studios. Visit online at www.sonicwebstudios.com for all you needs. Look at a professional website without breaking a budget. Sonic Web Studios is the answer. Sonic Web Studios offers fast, affordable, custom web designs that blow the competition away. Call today 1-800-303-3960. That's 1-800-303-3960 or email to support at sonicwebstudios.com. Mention The Mike Wagner Show. Get 20% off your first project. Sonic Web Studios. Take your image to the next level. Also time to give a shout out to official sponsor of The Mike Wagner Show, international war ring author Mian Mosen Zia. If you love fast paced mysteries, you'll love Missing by Mian Mosen Zia, available on Amazon and paperback and ebook. Missing is fast paced and intriguing with an unforgettable twist. It takes place in four countries, two strangers and one target. Where truth is an illusion and those you love be the first to go missing. It's on available on Amazon and paperback and ebook. Missing by Mian Mosen Zia has garnered great reviews and even loved and adored by Hollywood celebrities including Joanna Cassie, Forbes Riley and many others. So grab your copy today before it goes. Missing by Mian Mosen Zia, available on Amazon. Also on The Mike Wagner Show, can be here on themikewiternershow.com. You can check our Facebook page at facebook.com slash The Mike Wagner Show. You can download and listen on Facebook, SoundCloud, Spreaker, Spotify and iHeartRadio. Also on Anker FM, iTunes, Google Play, Amazon, Auto and Apple. Coming soon to Podbean, BuzzFrog, Pandora and Toon Name. Heard worldwide on Geo 7, Radio Public, Himalaya and more. Take The Mike Wagner Show at the end. Any mobile device. Subscribe to The Mike Wagner Show on the YouTube channel. Also follow The Mike Wagner Show on Instagram and Twitter today and check out The Mike Wagner Show merchandise at amazon.com slash The Mike Wagner Show. And for some great books, cool gift ideas and more, go to amazon.com slash Mian Mosen Zia. Order yours today. We're here with a terrific gentleman from New York City who is a photographer, documentary filmmaker and also does fiction film as well. He's involved in the New York Film Association and he's worked in tourism and wildlife as experience. Also has done TV programs and he's basically got a few films out right now. You can check it on YouTube and he's got some amazing projects. We'll like to talk about his career in the New York Film Association. Live ladies and gentlemen from the Pus Studios in beautiful downtown New York City. The very, very talented photographer, documentary filmmaker and in fiction film as well. Ladies and gentlemen, the very multi-talented Nelson Gomez. Nelson, good morning, good afternoon, good evening. Thanks for joining us today. Thank you for having me. Thank you for having me. Well, it's great to have you on board, Nelson. So you've been doing some photography, documentary, film work and involved in fiction film for quite some time and you're involved in New York Film Association. We'll talk more about that. You worked in tourism and wildlife experience and TV programs and also you've been in New York City for quite some time and also checked out some of your YouTube videos like New York Sleeps and also Gun Frame and New York Chat and more and talk about those and seeing us. Nelson, before we get into all that, tell us how it first got started, Nelson. Well, it all started when I was about 10 or 11 years old. My dad had a beer camera in his office and I just felt like a strong interest in learning how to use it. I took it away from his hands and with my cousins, we started creating our own type of films and my dad developed the film for us so we could watch it after that. Then growing up when I was 12 or 13, I started getting interested in music and understanding how to mix the sounds in order for later adding them to my own production filmmaking while growing up. I was going to say, I think somebody was trying to call you or something and tell them it's like, the piece is not ready yet. What was that one moment that precisely influenced you into what you're doing besides taking the camera from your dad and playing with it? What was that one precise moment that simply said to you, this is what I'm going to do for the rest of my life? I think it was, I was in college and I was starting architecture. It was my third year of architecture that I said, well, this is not working out for some reason. I got to just listen to my gut and my gut is saying it has always said that filmmaking is the way. I created this little short film where I expressed myself about what was going on in my life and what I needed and what I had to put away in order to fulfill whatever I needed to do. All my friends from architecture and my family really understood that that was the right decision. After that, I changed careers to production filmmaking and I graduated top of my class. I created documentary filmmaking that made a lot of awards and I had the chance to receive a half scholarship to study at the New York Academy the year prior to my graduation from college. Wow. That is amazing getting these awards as well too. You talked about doing these films and what do you base your films on? Normally if it is not a documentary, I like to write about romantic comedies. Normally I go through that genre. I usually take stories out of personal experiences, out of some friends' experiences, but I really try to focus on the human side of storytelling more than fiction side. If it is not a documentary, I like to focus more on the culture of the places I visit, the conservation of the environment, any type of genre related to that. That is interesting. You talked about the environment in some of your films. Do you use it to promote any causes or is it just something that you want to portray and say this is what is happening? Do you use the environment to promote certain causes that you believe in? What I do is I support my local marine biologists back in the Caribbean. I met most of them back in 2016, 2017 and I said why don't I use my film abilities to catapult whatever they are doing at the moment. It was not until 2016 that I really understood what was going on, at least in my area, my island where I lived in the Dominican Republic. I put all the fears aside from diving and getting myself into this underwater environment and try to cover everything I could, try to give them all the footage I could for their foundations and getting the work in motion. That is interesting. You say you have been in the Caribbean as well too and you also did some wildlife. Besides the Caribbean, where else have you gone to do some film work? I have filmed in California and New York. So far those are the only two places I have been filming. Most of my career has been developed in the Dominican Republic. That is amazing. Of course, you have a TV program as well too. You have some experience. What are some of the TV programs you have done? There is one TV program back in the Caribbean. I was in charge of traveling around the island in order to cover tourist places and highlight the culture and the big difference you can find in a very small island focused on the culture that every province has in the island and how much different it is from one another and how they work together as one. That is very amazing. We will talk about your work and be involved in the New York Film Academy and more. But first listen to the Mike Whitener Show at the MikeWhitenerShow.com powered by SoundCloud Web Studios. SoundCloud Web Studios offers fast, affordable, custom-made designs that blow the competition weight. Call today 1-800-303-3960 or email to support at SoundCloudWebStudios.com. Make sure the Mike Whitener Show gets 20% off your first project. SoundCloud Web Studios, take your image to the next level. Also time to give a shout out to official sponsor of the Mike Whitener Show, International War Ring author Mian Motsunziya. If you love fast-paced mysteries, you'll love Missing by Mian Motsunziya, available on paperback on Amazon and eBook. Missing is fast-paced and intriguing with an unforgettable twist. It takes place in four countries, two strangers and one target. When truth is an illusion and those you love be the first to go missing. Missing is available on paperback and eBook on Amazon. Missing by Mian Motsunziya has gotten great reviews and even loved and adored by Hollywood celebrities including Joanna Cassidy, Forbes Riley and many others. So grab your copy of Before It Goes Missing by Mian Motsunziya, available on Amazon. Also the Mike Whitener Show can be heard on the MikeWhitenerShow.com. You can check our Facebook page at Facebook.com slash the Mike Whitener Show. You can download and listen on Facebook, SoundCloud, Spreaker, Spotify and iHeartRadio. Also on Anchor FM, iTunes, Google Play, Amazon, Audible and Apple. Coming soon to Podbean, BuzzFod, Pandora and ToonNam. Heard worldwide on Geo 7, Radio Public, Himalayan and more. Take the Mike Whitener Show with you on any mobile device. Subscribe to the Mike Whitener Show on the YouTube channel and follow the Mike Whitener Show on Instagram and Twitter today and check out the merchandise section of the Mike Whitener Show. Go to Amazon.com slash the Mike Whitener Show and also check out some books and other cool gifts at Amazon.com slash Mian Motsunziya. Do it today. We're here with photographer, documentary filmmaker and also fiction film Nelson Gomez here on the Mike Whitener Show. We talk about some of his history, how he got involved in everything and he also got involved in New York Film Association for a little bit. You've done some great work and before we talk about that and some of your highlights on YouTube, who are some of your favorite photographers and also film directors growing up? Well, photographer, it feels more like. I don't know. I do not have any favorite photographer or no. I don't have any favorite photographer. It's really impressive, but that's the truth. Or you can say yourself as well too, but how about some film directors growing up? I don't know. I don't. I don't. I don't have any favorite. I just focus on the story. If the story is good, it doesn't matter to me who did it. If the story tells me, I mean, I'm hooked. That's why I say that. That's why I try not to tie myself to any director or photographer. So because I think if I do that, I just miss out on any other artists out there that's doing a lot of good things as well. So you're pretty much looking to create your own niche and not follow any photographers or directors that are out there. I try to be open to any new work that anyone is doing. It could be films from Hollywood and it could be any independent film or film, let's say India or Asian film, anything. If the story is good, I mean. Speaking of stories when it comes to films and everything, what are some of your favorite films so far and especially the ones growing up? Interstellar has to be my favorite film so far. I will say that films that are focused on playing with time could be my favorite type of storytelling. The inception into Interstellar and yeah, Back to the Future, any film that's based on time traveling, on time dilation. Yeah, Back to the Future. Come on Marty, get in. Oh my gosh. My wife gets into time travel films as well too, like with Time Machine, Time Doctor, Doctor Who and everything else. And of course, we can talk more about that later on as well too. Maybe if you fast forward like to 2100, even go back to say 1900 or something like that. But we can talk later as well too. You also have some films as well too, like New York Sleeps and also Gun Free, New York Chat and more. You could also tell us about some of the films you've done. Well, New York Sleeps is based on the pandemic in New York City and how the city changed from being very active to being very quiet, yet under chaos, we'll say. And Gun Free is based on a story of a cop who will be signing his spot as a police officer after he lost his friend in duty. And after that, he suffered from PTSD and couldn't handle just thinking about it, talking about it. And it took him a long time to recover from that loss. Yeah, it seems like a very common theme too, people suffering from PTSD. And you cover some of these sensitive areas. And any subject you plan on covering the future with your films, like say, for example, PTSD or more in the pandemic or anything that's going on in the world, where are some of the subjects you're looking to cover in the future? I like to get a little bit apart from the romcom and get focused more on the subject of suicidal stories and try to get myself into that, creating a story about why people commit suicide and how could it be prevented. I was thinking about a story about a guy who wants to jump from the highest bridge he can find and for that he has to travel through the whole USA to get to this place. But after he gets to that place, he understands what's really important in life. And there you ask yourself, is it really necessary or is it really your destiny to really take your own life away and all that? And what can people learn from the majority of your movies? What's the message you're trying to get out there? The message is to enjoy the process of life. It's very important not to wait to reach your goal in order to start celebrating because at that time, maybe it's going to be too late. You're not going to have anyone beside you or you're going to lose yourself in the process if you don't understand and if you don't keep in mind to really appreciate every step you take forward. And of course, that's a good portion of films as well too and they're amazing and you're also being involved in the New York Film Association as well too. And tell us about that and what's your involvement with the New York Film Association? Last year I was in the New York Film Academy. I received the Habs Scholarship to study documentary filmmaking for a whole year. I met amazing people, amazing professors and thanks to them, I had the chance to get my first job here in my hands with Domestika who is teaching me a lot. We meet new artists every week who we film their courses for online consumers and it's been amazing so far. And that sounds amazing as well too. What's coming up for 2021 with Nelson Gomez? We'll find out in just one minute. You listen to The Mike Wagner Show at themikewagnershow.com powered by Sonic Web Studios. This is online at sonicwebsudios.com for all he needs. Also brought to you by our official sponsor, The Mike Wagner Show, international warring author, me and Mohsen Zia of the book Missing, available on Amazon and paperback and ebook. We'll be back with filmmaker Nelson Gomez after this time out. The Mike Wagner Show is powered by Sonic Web Studios. If you're looking to start or upgrade your online presence, visit www.sonicwebstudios.com for all of your online needs. Call 1-800-303-3960 or visit us online at www.sonicwebstudios.com to get started today. Mention The Mike Wagner Show and get 20% off your project. Sonic Web Studios, take your image to the next level. Hey everybody, my name is Forbes Riley and I'm an American actress and a TV host. And I was delighted when I got my copy of Missing, which is Extraordinary Relations of Ordinary People Based on a Real Life Relationship. It's just, it's well written. It's amazing. You know, it talks about a man who has lost his wife and his daughter and it's very well done. I'm going to highly recommend that you go get your copy of Missing. It is a powerful, exciting read. Mr. Me and Mohsen Zia. He is the author of Missing. And I want to give a big shout out and a kiss all the way halfway around the world to my dear friend. Check him out at Mia's website. It's called www.mia.mohsenzia.com. Missing. Available on Amazon. Again, I'm Forbes Riley and I will see you again soon. Bye bye. Hey everybody, it's Mike from The Mike Wagner Show. The Mike Wagner Show can be heard on over 30 podcast platforms including Facebook, SoundCloud, Spreaker, Spotify, iHeartRadio, Anchor FM, iTunes, Google Play, Amazon, Audible, Apple and more coming soon to Podbean, BuzzFrog, Pandora and tune in where The Mike Wagner Show interviews great guests, cool conversation, lots of laughs, coffee and more. Take The Mike Wagner Show with you on any mobile device. Subscribe to The Mike Wagner Show on the YouTube channel and follow The Mike Wagner Show on Instagram and Twitter today. Hey, hey, this is Ray Powers. And if there's one thing you can count on in these unpredictable times, it's that you're in good hands getting some great radio courtesy of The Mike Wagner Show. We're back with award winning filmmaker documentary, filmmaker, photographer and more Nelson Gomez of New York City on The Mike Wagner Show attended New York Film Academy. And you know, just a couple of things as well to your career has been amazing. Love to have back on and talk more about your films and what can you expect from me in 2021 and beyond, Nelson? I'm I'm trying to I'm trying to travel a little bit more, trying to cover a little more of the USA, find a fine new stories, adapt them to film, to fiction film. And yeah, trying to widen my horizons, if I may say. I'm also trying to put my hands on flights to other parts of the globe, let's say India, which I was planning to go to India this year. But sorry, last year, 2020, about due to pandemic. Well, I couldn't. And I was planning to get together with some friends that are involved in the Bollywood or in the Indian film industry as well. Tried to adapt myself to that. But yeah, that's the that's like the plan. I was trying to find stories all around the USA and write about them, film a document, every people interview them. And out of that, we have scripts or sketches or whatever comes to mind in order to like build stories. It sounds like you got a lot of things ahead of you. We're looking forward to that. And who do you consider biggest influence in the career now? Some. My career, my biggest influence in the career. Right now, I've been seeing a lot of Matthew McConaughey in his new book, Green Light. I really like the way he talks about his experience in the film industry and how he and how he really gives importance to the practical knowledge of what he does. He makes sure that his readers or his students don't take the academic part of the studying very seriously. So, you know, not to forget about going out there and really like putting into the tests. And I really like that about what he's talking about, not fear to fail or to be judged by anyone. Yeah. And that's very amazing too, is one of my favorites. And I'm looking forward to what he got as well too. And what's the best advice you can give to anybody at this point? Well, my best advice is, as I said before, is to enjoy the process. Enjoy the process. Keep your eye open. Just do any opportunity, try to say yes to any opportunity that doesn't harm you physically or emotionally. And really try not to wait to the last minute or two when you reach your goal to start celebrating. Start celebrating from now. Start celebrating that you already had the simple thought of moving forward. And I assure you, you'll be grateful at the end. It sounds like it. You got an amazing plan, Nelson. Once again, Nelson Gomez, photographer, documentary filmmaker, more on the Mike Wagner show. Nelson, very big thank you for your time. You've been absolutely fantastic. Looking forward to having you again soon. Just keep us up to date and tell us about your upcoming projects, what's your website, how do people contact you, where can people check out your works? Well, you can visit my Instagram page, it's NegoTravels. And there you'll find my link to my website and my YouTube channel. That is amazing. And Nelson, a very big thank you for your time, you've been absolutely fantastic. Looking forward to having you again soon. Do us a favor, keep us up to date. Love you back on in 2021 and beyond. And don't forget to keep in touch. You've been absolutely fantastic. Thank you very much. Thank you for having me. Hey everybody, my name is Forbes Riley and I'm an American actress and a TV host. And I was delighted when I got my copy of Missing, which is extraordinary relation of ordinary people based on a real life relationship. It's just, it's well written. It's amazing. You know, it talks about a man who has lost his wife and his daughter and it's very well done. I'm going to highly recommend that you go get your copy of Missing. It is a powerful, exciting read. Mr. Mian Moshezia, he is the author of Missing. And I want to give a big shout out and a kiss all the way halfway around the world to my dear friend. Check him out at Mia's website. It's called www.miamotionsea.com. Missing available on Amazon. Again, I'm Forbes Riley and I will see you again soon. Bye bye. The Mike Wagner Show is powered by Sonic Web Studios. If you're looking to start or upgrade your online presence, visit www.sonicwebstudios.com for all of your online needs. Sonic Web Studios specializes in custom web design, app development, social networking, search engine optimization, domain registration, email marketing, online stores and more. Since our birth, we have been designing and developing immaculate websites and providing web solutions which are a cut above the rest. As a leading web designing enterprise, we have a team of extremely talented web designers who are well focused and have the experience of working on multiple web developing platforms such as PHP, Magento, custom WordPress and more. Sonic Web Studios has been helping businesses of all kinds, whether big, small, established or startup, impress their audiences with exemplary web solutions. We don't just create beautiful and functional websites. We give you a complete online solution with the main goal of enhancing your yearly revenues. We aim to give your business the online exposure and brand acknowledgement that will help you in achieving increased conversions leading to profitable sales. Call 1-800-303-3960 or visit us online at www.sonicwebstudios.com to get started today. Mention The Mike Wagner Show and get 20% off your project, Sonic Web Studios. Take your image to the next level. Thanks for listening to The Mike Wagner Show powered by Sonic Web Studios. Visit us online at www.sonicwebstudios.com for all your needs. The Mike Wagner Show can be heard on Spreaker, Spotify, iHeart Radio, iTunes, YouTube, Anchor FM, Radio Public and themikewagnershow.com. Please support our program with your donations at themikewagnershow.com. Join us again next time for another great episode of The Mike Wagner Show."
    },
    "podcast_summary": "Nelson Gomez is a photographer and documentary filmmaker based in New York City. He has worked on various projects and has experience in tourism, wildlife, and TV programs. Nelson's career began at a young age when he started experimenting with his father's camera. His passion for filmmaking led him to study at the New York Film Academy, where he received a half scholarship for his documentary work. Nelson's films often focus on the human side of storytelling, covering subjects such as the pandemic, police officers dealing with PTSD, and more. He is also involved in the New York Film Association and is planning to travel and explore new stories in the future. Nelson's advice to others is to enjoy the process and celebrate each step along the way. You can find Nelson on Instagram, under the handle @neegotravels, where he shares his work and links to his website and YouTube channel.",
    "podcast_guest": "Nelson Gomez",
    "podcast_guest_details": {
        "Guest Name": "Nelson Gomez",
        "Guest Job": "photographer, documentary filmmaker, fiction filmmaker",
        "Guest Fame": null,
        "Guest City": null,
        "Guest Website": "www.instagram.com/negotravels",
        "Guest Media": null
    },
    "podcast_highlights": {
        "highlight_1": "Nelson Gomez started his filmmaking journey at a young age.",
        "highlight_2": "He is passionate about telling stories focused on the human side of storytelling.",
        "highlight_3": "Nelson has filmed in California and New York, as well as the Caribbean.",
        "highlight_4": "He plans to cover subjects like suicide and the importance of appreciating every step in life."
    },
    "podcast_score": {
        "score": "4",
        "review": "I enjoyed listening to this podcast. Mike Wagner is a skilled interviewer and he brought out the best in his guest, Nelson Gomez. I appreciated hearing about Nelson's journey as a photographer and filmmaker, and his passion for storytelling. The discussion about the importance of enjoying the process and celebrating small victories was inspiring. Overall, it was an engaging and informative episode."
    }
}